[{"date":"2013-07-12T11:22:15.578Z","articles":[{"guid":"video-embedding-websites-has-been-released-instagram","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/insta.jpg","title":"Video embedding on websites has been released by Instagram","description":"\n<h3>\r\n\tInstagram has just added a new feature, an important one actually, that allows users to embed videos on websites.</h3>\r\n<!--break-->\r\n<p>Embedding videos on sites is a large enhancement for the company’s video-sharing services. This capability was reportedly launched yesterday.</p>\r\n<p>The protocols for embedding videos from Instagram are actually very similar to YouTube. You can simply just copy an html code (that appears from selecting “share” under a video) and go to your website to paste it.</p>\r\n<p>If you want people to be able to view more of your photos on your Instagram page, they can simply click on the Instagram logo under your embedded photo/video that shows up with your username.</p>\r\n<p>The video-sharing service offered by Instagram allows users to upload videos that can be up to 15 seconds long. This is seen as a move by Facebook to stay up to par with its competition. The Vine video app from Twitter has become more prevalent and serves as one of the reasons why Facebook made this attempt.</p>\r\n<p>Mobile users will be especially satisfied with Instagram’s video share feature. Social media addicts, get ready for increasing your Instagram use.&nbsp;</p>\r\n\n\n","summary":"\r\n\tInstagram has just added a new feature, an important one actually, that allows users to embed videos on websites.","categories":["Facebook","Instagram","Twitter","Videos","General"],"author":"micha","pubDate":"2013-07-11T17:15:58.000Z"},{"guid":"upcoming-blackberry-a10-focus-big-gaming-and-performance","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/blackberry-logo.png","title":"Upcoming BlackBerry A10 to focus big on gaming and performance","description":"\n<h3>\r\n\tBlackBerry’s next next flagship smartphone will have a big focus on power and gaming, according to reports.</h3>\r\n<!--break-->\r\n<p>Citing sources, <a href=\"http://bgr.com/2013/07/10/blackberry-a10-aristo-blackberry-9720/\" target=\"_system\">BGR</a> reports that BlackBerry is hoping to appeal to both gamers and developers with its next handset.</p>\r\n<p>It said that the BlackBerry A10 will have a “big focus on power and gaming”. The sources also claim the handset will be “the most powerful, capable BlackBerry” sold by the company.</p>\r\n<p>The device is said to feature a 5-inch Super AMOLED display, 2GB of RAM and a dual-core processor. The sources said that the company decided against including a quad-core processor due to battery life concerns.</p>\r\n<p>The sources did not detailed whether the phone will come with the rumoured 8-megapixel camera.</p>\r\n<p>Previous reports have said that the company wants to align its future devices against the iPhone and Galaxy S4.</p>\r\n<p>BlackBerry reported intends the A10 to have a “huge focus on gaming”. It is unclear if the company has signed any developers up to create games for the device or whether it is hoping that developers will port their existing titles.</p>\r\n<p></p>\r\n\n\n","summary":"\r\n\tBlackBerry’s next next flagship smartphone will have a big focus on power and gaming, according to reports.","categories":["Blackberry 10","BlackBerry","BlackBerry A10","BlackBerry leaks","BlackBerry Phones","Blackerry A10","Phones","Smartphone games","SmartPhones","General"],"author":"T3 Middle East","pubDate":"2013-07-11T15:44:13.000Z"},{"guid":"best-ear-headphones-earbuds-buy-2013","type":"features","image":"http://www.t3me.com/sites/default/files/feature/2013/07/Sony_XBA-4-headphones.jpg","title":"Best in-ear headphones (earbuds) to buy in 2013","description":"\n<h3>\r\n\tIf you're less than impressed with the earphones that were bundled with your iPhone 5 or Galaxy S4, fear not - there are plenty of great alternatives that ensure you won't be suffering in silence.</h3>\r\n<!--break-->\r\n<p>Top in ear headphones will upgrade your listening experience no end, and free you from noisy passengers and sore ear canals... A pair of really good in ear headphones can assure your daily commute is kept lively and free of the incessant natterings of fellow passengers. However, where to start? Well, right here actually, with our list of top in-ear headphones you can buy right now.</p>\r\n<p><br />\r\n</p>\r\n<p><img class=\"xLImg img hero lM\" height=\"282\" src=\"http://media.t3.com/img/resized/so/xl_SonyXBA-4.jpg\" style=\"z-index: -1; margin: 5px;\" width=\"501\" /></p>\r\n<h3>\r\n\t1. Sony XBA-4</h3>\r\n<p>The feature that sets these Sony buds apart from the crowd is their four balanced drive units, which gives each ear the pleasure of a full-range driver, woofer and tweeter plus an additional super-woofer for extended sub-bass. In short, they sound incredible and the noise isolation is also top drawer, so you can really get lost in your tunes.</p>\r\n<p><strong>Price</strong>: $299 | <a href=\"http://www.sony.co.uk/product/hps-in-ear-performance/xba-4\" target=\"_system\">Sony</a> |<br />\r\n</p>\r\n<p></p>\r\n<p></p>\r\n<p><img align=\"bottom\" alt=\"T3 Middle East\" border=\"0\" height=\"282\" hspace=\"5\" src=\"http://t3me.com/sites/default/files/pictures/2013/quick/xl_a-jays%20-%20web_2.jpg\" vspace=\"5\" width=\"502\" /></p>\r\n<h3>\r\n\t2. a-Jays One+</h3>\r\n<p>Ear-phones have always had one particularly annoying issue, those tangled cables when you pull them out your pocket. Jays have tried to combat this perennial issue by developing a tangle resistant, flat cable and pairing it with deep bass response to give the perfect mix of practicality and sound quality. There’s also a companion Android app to give deeper sound customisation.</p>\r\n<p><strong>Price</strong>: $60 | <a href=\"http://www.jays.se/products/a-jays-one-plus\" target=\"_system\">Jays</a> |</p>\r\n<p></p>\r\n<p><br />\r\n</p>\r\n<p><img align=\"bottom\" alt=\"T3 Middle East\" border=\"0\" height=\"283\" hspace=\"5\" src=\"http://t3me.com/sites/default/files/pictures/2013/quick/xl_Atomic_Floyd_Powerjax.jpg\" vspace=\"5\" width=\"504\" /></p>\r\n<h3>\r\n\t3. Atomic Floyd PowerJax</h3>\r\n<p>With a mix of bright red, silver and black, these earphones are anything but subtle, yet it’s their durability that really makes them stand out. Sound quality is good too, with strong bass and clarity levels, though they can sometimes suffer at high volume. Great noise isolation, however, make these perfect buds for commuters.</p>\r\n<p><strong>Price</strong>: $150 | <a href=\"http://www.atomicfloyd.com/powerjax_remote\" target=\"_system\">Atomic Floyd</a> |</p>\r\n<p><br />\r\n</p>\r\n<p></p>\r\n<p><img align=\"bottom\" alt=\"T3 Middle East\" border=\"0\" height=\"281\" hspace=\"5\" src=\"http://t3me.com/sites/default/files/pictures/2013/quick/xl_beyerdynamic%20-%20web_2.jpg\" vspace=\"5\" width=\"500\" /></p>\r\n<h3>\r\n\t4. Beyerdynamic MMX 101iE</h3>\r\n<p>If you’re forever answering your phone hands-free, yet don’t want to compromise the quality of your tunes, these could win you round. With ambient noise isolation for making those office calls crystal clear, a remote to quickly answer and Neodymium HD acoustic drivers for great sound, they are the full package.</p>\r\n<p><a href=\"http://north-america.beyerdynamic.com/shop/mmx-101-ie.html\" target=\"_system\">Beyerdynamic</a></p>\r\n<p></p>\r\n<p><br />\r\n</p>\r\n<p><img align=\"bottom\" alt=\"T3 Middle East\" border=\"0\" height=\"282\" hspace=\"5\" src=\"http://t3me.com/sites/default/files/pictures/2013/quick/xl_bose%20-%20web.jpg\" vspace=\"5\" width=\"502\" /></p>\r\n<h3>\r\n\t5. Bose SIE2i Sport</h3>\r\n<p>Bose are entering the sports-wear market with their latest pair of in ear buds, looking to pair durability with their penchant for sound quality. Packing a comfortable and secure housing, resistance to sweat and weather along with Bose’s Tri-Port headphone technology, these will make those trips to the gym far more bearable.</p>\r\n<p><a href=\"http://www.bose.co.uk/GB/en/home-and-personal-audio/headphones-and-headsets/sport-headphones/bose-sie2i-sport-headphones/\" target=\"_system\">Bose</a></p>\r\n<p></p>\r\n<p><br />\r\n</p>\r\n<p><img align=\"bottom\" alt=\"T3 Middle East\" border=\"0\" height=\"282\" hspace=\"5\" src=\"http://t3me.com/sites/default/files/pictures/2013/quick/xl_klipsch%20-%20web_2.jpg\" vspace=\"5\" width=\"502\" /></p>\r\n<h3>\r\n\t6. Klipsch Image X7i</h3>\r\n<p>Rather than being made of the typical plastic, these headphones are in fact crafted from ceramic - the very same as your coffee mug. Klipsch claim this gives them added durability, along with a certain elegance, and we have to agree. Expect excellent sound quality coupled with a handy remote and tangle-free wires.</p>\r\n<p><a href=\"http://www.klipsch.com/image-x7i-black-headphones\" target=\"_system\">Klipsch</a></p>\r\n<p></p>\r\n<p><br />\r\n</p>\r\n<p><img align=\"bottom\" alt=\"T3 Middle East\" border=\"0\" height=\"282\" hspace=\"5\" src=\"http://t3me.com/sites/default/files/pictures/2013/quick/xl_nocs%20-%20web.jpg\" vspace=\"5\" width=\"502\" /></p>\r\n<h3>\r\n\t7. Nocs NS400</h3>\r\n<p>Packing machined aluminium housings and Kevlar reinforced cables, Nocs have gone all-out to create some seriously durable buds. They’re not skimping on the sound quality either, these tiny buds deliver huge basslines with aplomb. The anti-tangle flat cable works well, and the low-profile L-jack plug should prevent cable damage longer-term. Smartphone controls are present and accounted for as well.</p>\r\n<p><a href=\"http://nocs.myshopify.com/products/ns400-flat-cable\" target=\"_system\">Nocs</a></p>\r\n<p><br />\r\n</p>\r\n<p></p>\r\n<p><img align=\"bottom\" alt=\"T3 Middle East\" border=\"0\" height=\"283\" hspace=\"5\" src=\"http://t3me.com/sites/default/files/pictures/2013/quick/xl_senheiser.jpg\" vspace=\"5\" width=\"504\" /></p>\r\n<h3>\r\n\t8. Sennheiser CX 890i</h3>\r\n<p>Smartphone pack in headphones are usually pretty poor (yes, even your EarPods Apple) so to go with your shiny new device it’s best to invest in some new buds. These are small, lightweight and rugged but still offer great all-round sound quality. However, they are a tad pricy for what they are and the design doesn't stand out from the crowd much.</p>\r\n<p><a href=\"http://en-uk.sennheiser.com/ear-headphones-headset-smart-phones-mobile-cx-890i\" target=\"_system\">Sennheiser</a> |</p>\r\n<p></p>\r\n<p><br />\r\n</p>\r\n<p><img align=\"bottom\" alt=\"T3 Middle East\" border=\"0\" height=\"281\" hspace=\"5\" src=\"http://t3me.com/sites/default/files/pictures/2013/quick/xl_SennheiserIE800.jpg\" vspace=\"5\" width=\"500\" /></p>\r\n<p>If you have money to burn, and want some small, in ear buds with sound quality to rival even the best over ear models then these IE800s from Sennheiser tick all the boxes. The durable cable is detachable and features gold plated connections at either end, while the buds themselves delivered fantastic performance from anything we threw at it. Pricey, yes... but this is luxury you can ill afford to miss.</p>\r\n<p><strong>Price</strong>: $900 | <a href=\"http://en-uk.sennheiser.com/in-ear-headphones-earphones-ie-800-ceramic\" target=\"_system\">Senheisser</a><br />\r\n</p>\r\n\n\n","summary":"\r\n\tIf you're less than impressed with the earphones that were bundled with your iPhone 5 or Galaxy S4, fear not - there are plenty of great alternatives that ensure you won't be suffering in silence.","categories":["Blackberry 10","BlackBerry leaks","Audio - Music","Audiophile","Audiophile equipment","Best of","Best Of","BlackBerry","Blackerry A10","Earbuds","Headphones","headset","Music","ألعاب الجوال","بلاكبيري","بلاكبيري 10"],"author":"T3 Middle East","pubDate":"2013-07-11T14:31:55.000Z"},{"guid":"amiga-games-of-golden-age-soon-ios-and-android","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/Amiga_1010_Disk_Drive_moparx.jpg","title":"Amiga Games of the golden age soon on iOS and Android?","description":"\n<h3>\r\n\tAn LA based company has bought Amiga Games Incorporated and more than 300 of its titles.</h3>\r\n<!--break-->\r\n<p>The Writers Group Film Corp announced yesterday that it has signed a binding term sheet to purchase the assets of the company for $500,000.</p>\r\n<p>Along with the Atari ST and Spectrum, the Amiga was one of the major computer gaming platforms of the late 80s and early 90s. It was made by American company Commodore.</p>\r\n<p>Old gamers remember fondly the platform which introduced them to gaming gems such as <em>Sensible Soccer</em>, <em>Syndicate</em>, <em>Lemmings</em>, <em>Cannon Fodder</em>, <em>Worms</em>, <em>Shadow</em> <em>of The Beast</em> and <em>Another World</em>.</p>\r\n<p></p>\r\n<h4>\r\n\tOldschool gamers rejoice</h4>\r\n<p>In a statement, the company said it would release more news in the coming weeks about “new and existing distribution arrangements with the best-selling smartphone, tablet and other device manufacturers”.<br />\r\n\t<br />\r\n\tThe platform helped form the careers of many of today’s gaming giants. Both Simcity’s Will Wright and Railroad Tycoon’s Sid Meier first established themselves on the platform.</p>\r\n<p>Feeling Nostalgic already? Any game would like to revisit in particular?</p>\r\n<p><img align=\"bottom\" alt=\"T3 Middle East\" src=\"http://t3me.com/sites/default/files/pictures/2013/quick/amiga-games.jpg\" style=\"border-width: 0px; border-style: solid; margin: 5px; width: 620px; height: 92px;\" /></p>\r\n<p></p>\r\n\n\n","summary":"\r\n\tAn LA based company has bought Amiga Games Incorporated and more than 300 of its titles.","categories":["Amiga","android apps","Android games","Apple Games","Apps - Software","Commodore","Computer Software","Games","Gaming","iOS games","iPhone games","Phone Apps","Retro","Smartphone Games","General"],"author":"Simon Khoury","pubDate":"2013-07-11T11:23:33.000Z"},{"guid":"co-founder-of-pirate-bay-welcomes-hemlis-messaging-app","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/pirate bay.jpg","title":"Co-founder of Pirate Bay welcomes Hemlis messaging app","description":"\n<h3>\r\n\t<span style=\"line-height: 20px;\">In light of the recent Prism Scandal, communication tech users have been on edge when it comes to using sites like Pirate Bay.&nbsp; To bring some ease to the situation, the company’s co-founder, Peter Sunde, has just announced the launch of Hemlis, an encrypted messaging app.</span></h3>\r\n<!--break-->\r\n<p>The Scandinavian-owned company, Pirate Bay, is looking at a new alternative to make sure that a messaging platform secure from the risk of spying is made available.</p>\r\n<p>Hemlis means ‘secret’ in Swedish. The app is free and is specific to encrypting messages among users from the start point of the message to the arrival point. This is facilitated by the use of up-to-date technology that guarantees the privacy of message senders and recipients. &nbsp;</p>\r\n<p>If you visit the official website of the app, you’ll see the reference to the latest Prism scandal and listed threats to trusting in recognized networks or devices.</p>\r\n<p>A statement on the app’s site claims that social networking sites like Facebook and Twitter, along with other companies including Apple and Google, have been secretly forced to disclose their users’ information upon having their systems opened. In addition, they have reportedly been prohibited from telling anyone that this is being done, so Hemlis’ site responded by stating that it would just prefer to just shut down their services before doing this to their users.</p>\r\n<p>Hemlis-makers refuse to sell user data, even though most apps funded by advertisers do sell the data. The crowdsourcing project to fund the app is underway and has thus far raised more than $18,500.</p>\r\n<p></p>\r\n\n\t\n","summary":"\r\n\tIn light of the recent Prism Scandal, communication tech users have been on edge when it comes to using sites like Pirate Bay.  To bring some ease to the situation, the company’s co-founder, Peter Sunde, has just announced the launch of Hemlis, an encrypted messaging app.","categories":["Apps - Software","Censorship","censorship","Facebook","security","social","The Pirate Bay","Twitter","Web and Social Media","General"],"author":"micha","pubDate":"2013-07-11T10:18:28.000Z"},{"guid":"lg-optimus-g2-specs-images-leaked","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/LG-Optimus-G2-leak-5.jpg","title":"LG Optimus G2 specs & images leaked","description":"\n<h3>\r\n\tThe design, and some of the specs, of the mighty LG Optimus G2 have been leaked.</h3>\r\n<!--break-->\r\n<p>A large number of spyshots of the upcoming phone have been gathered ahead of its official unveiling in August. The gallery, compiled by <a href=\"http://www.engadget.com/2013/07/09/lg-optimus-g2-leak/\" target=\"_system\">Engadget</a>, show off a smartphone that bears a striking resembelance to the Nexus 4, which LG makes for Google.</p>\r\n<p>The LG Optimus G2 is the successor to the original Optimus.<br />\r\n\t<br />\r\n\t<iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/xRtCJmcw-6A?feature=player_embedded\" width=\"640\"></iframe></p>\r\n<p>According to Engadget, the LG Optimus G2 features a 5.2-inch, 1080p display with a thin bezel. It also features a front-facing camera and three capacitative buttons.</p>\r\n<p>The phone is also confirmed to be feature Qualcomm’s top of the range Snapdragon 800 processor, making it one of the fastest processors out there.<br />\r\n\t<br />\r\n\tThe images also confirm that the volume rocker will be on the back of the device, as opposed to the side as is normally the case with smartphones.<br />\r\n\t<br />\r\n\tWhile few other details are know, the camera is rumoured to be 13-megapixels with a rear flash.<br />\r\n\t<br />\r\n\tThe phone will officially be launched on August 7th with a Q3 launch.</p>\r\n<p></p>\r\n\n\t\n","summary":"\r\n\tThe design, and some of the specs, of the mighty LG Optimus G2 have been leaked.","categories":["Android","Android Phones","leaks","LG","Optimus G Pro","Optimus G2","Optimus g2","Phones","SmartPhones","upcoming devices","General"],"author":"T3 Middle East","pubDate":"2013-07-11T08:08:42.000Z"},{"guid":"preordering-google-glass%E2%80%99s-competition-recon-jet-now-possible","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/large_Recon-Jet_thumb.jpg","title":"Preordering Google Glass’s competition, Recon Jet, is now possible","description":"\n<h3>\r\n\tRecon’s sunglasses may shade Google Glass with their comparably acceptable preorder price tag, at just less than half the price, bargain?</h3>\r\n<!--break-->\r\n<p>Watching out for the Google Glass craze, expected to make its debut in 2014, may have become a bit downplayed. Although, it is still not certain when exactly it’ll launch next year (early or mid), other similar devices are already being revealed and upping the competition. One company in particular, Recon Instruments, has already placed its Google Glass-like sunglasses, the Recon Jet, on the market as it is now accepting preorders.</p>\r\n<p>For those of you who are really into sports, the Recon Jet has similar internal qualities to those of Glass. These include a dual-core processor, a 720p camera, and 8GB of storage along with additional attributes. Also, other features consist of sensors including a barometer, accelerometer, and magnetometer. These cool sunglasses run a version of Android; customized, to be exact.</p>\r\n<p>The sensors coordinate with your favorite daily activities by delivering content in real-time. This information includes being able to connect a smartphone through Bluetooth to have caller ID and SMS context. In terms of real-time information, speed and heart-rate along with many more pieces of content are among those provided.</p>\r\n<p>The Recon Jet is now available for preorder for $499 until July 21, which is even less than half the cost of the Google Glass (Explorer Edition). By the end of the month, the price of the Recon device is said to go up to around $599. With the holidays conveniently landing in December, that is the expected shipping time for these innovative shades. &nbsp;</p>\r\n\n\n","summary":"\r\n\tRecon’s sunglasses may shade Google Glass with their comparably acceptable preorder price tag, at just less than half the price, bargain?","categories":["Android","Google Glass","google glass","Recon Jet","Product Releases"],"author":"micha","pubDate":"2013-07-10T15:09:15.000Z"},{"guid":"your-google-circle-can-now-see-your-1s-streams","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/google +.jpg","title":"Your Google+ circle can now see your +1s in streams","description":"\n<h3>\r\n\tWith the most recent update, you can “like” and be liked on Google’s +1 feature.</h3>\r\n<!--break-->\r\n<p>Google’s +1 feature allows users to recommend the content on your website on Google Search and additionally provides the ability to share the content on Google+.&nbsp; You can modify even the most detailed attributes such as the button size and your preferred loading method.</p>\r\n<p>The main advantage to adding a Google +1 button to your website is having the capability to generate more traffic to your site while increasing the time spent on it as well by recommending other pages to read to visitors.</p>\r\n<p>With these advantages, Google has added an additional feature to its +1 element that allows it to serve as a “like” button, such as those found in other social network sites like Facebook. Instead of going to a user’s profile to view the content they +1’d, as necessary before today, now you can simply view posts that are highlighted by those in your circle and in turn, they can see which posts you have a placed a +1 mark on, as well.</p>\r\n<p>Regardless of this update to use the +1 feature in a less tedious manner, the security settings can still be configured in the same way as before. Meaning, you can still control who sees your +1s and decrease the volume of updates on your stream if too many items are being generated for your taste.</p>\r\n<p>The enhancements on the feature are expected to show up in the next few days.</p>\r\n\n\n","summary":"\r\n\tWith the most recent update, you can “like” and be liked on Google’s +1 feature.","categories":["Google","Google Plus","General"],"author":"micha","pubDate":"2013-07-10T11:28:02.000Z"},{"guid":"lumia-1020-eos-image-leaked-ahead-of-thursdays-launch","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/Lumia 1020 3 colors.jpg","title":"Lumia 1020 (EOS) image leaked ahead of Thursday's launch","description":"\n<h3>\r\n\tPictures of the Nokia Lumia 1020 have leaked ahead of its official launch on Thursday.</h3>\r\n<!--break-->\r\n<p>The Windows Phone 8 device is rumoured to feature a 41-megapixel camera. The 1020 name first emerged on Monday after leaked EXIF data appeared on Flickr.<br />\r\n\t<br />\r\n\tIt has previous been known by a number of codenames, including EOS, Pureview EOS, Lumia 909 and internal codename Elvis.<br />\r\n\t<br />\r\n\tThe leaked renders show yellow, white and black versions of the phone.<br />\r\n\t<br />\r\n\t<br />\r\n\t<br />\r\n\t<br />\r\n\t<br />\r\n\tAccording to information leaked to <a href=\"http://www.wpcentral.com/new-render-41mp-nokia-lumia-1020-more-details\" target=\"_system\">Windows Phone Central</a>, the handset will also ship with built-in optical image stablisation, 2GB of RAM and 32GB of internal storage. It also claimed it will have an F2.2 lens. Interestingly, that is the same as the EXIF data that appeared on Monday.<br />\r\n\t<br />\r\n\tOther information reported by Windows Phone Central include that the phone will feature both a Xenon and an LED flash, with optical image stabilisation (like the Lumia 920) for excellent low-light shots. Ultrasampling technology makes a comeback from the Pureview 808 when shooting at a resolution of 5 megapixels. Every 7 pixels will be combined into one mega-pixel for superb detail and lossless digital zoom (brush up on that technology by reading our <a href=\"http://www.google.com.lb/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=1&amp;cad=rja&amp;ved=0CC0QFjAA&amp;url=http%3A%2F%2Fwww.t3me.com%2Fcategory%2Ffree-tags%2Fnokia-pureview-808&amp;ei=wFzcUYjRKMS64ATA1IGQCQ&amp;usg=AFQjCNGstCXnqEBflJQy8GSDnM9RrtCCww&amp;sig2=_domigONWRWRX3DYL2SlyQ&amp;bvm=bv.48705608,d.bGE\" target=\"_system\">Pureview 808 review</a>).</p>\r\n<p></p>\r\n<p><img align=\"bottom\" alt=\"T3 Middle East\" border=\"0\" height=\"234\" hspace=\"5\" src=\"http://t3me.com/sites/default/files/pictures/2013/quick/Nokia_1020_leak_evleaks-580-75.jpg\" vspace=\"5\" width=\"417\" /></p>\r\n<p>We're packing our bags for Nokia's Thursday event. We'll bring you more details then!</p>\r\n\n\n","summary":"\r\n\tPictures of the Nokia Lumia 1020 have leaked ahead of its official launch on Thursday.","categories":["Camera Phones","Lumia 1020","Lumia 909","Nokia","nokia lumia pureview eos","Phones","Pureview EOS","SmartPhones","Windows Phone 8","Windows Phone Devices","General"],"author":"Simon Khoury","pubDate":"2013-07-09T06:58:08.000Z"},{"guid":"grand-theft-auto-5-gameplay-video-released","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/GTA-5-6-624.jpg","title":"Grand Theft Auto 5 gameplay video released","description":"\n<h3>\r\n\tThe first Grand Theft Auto 5 gameplay footage has been shown off in a new video released by Rockstar Games.</h3>\r\n<!--break-->\r\n<p>Is there any game that players are looking forward to more than Grand Theft Auto 5? The latest installment in Rockstar Games's highly rated open-world urban crime series is easily the most anticipated game of 2012 and arguably the best reason to hang onto your current gen console.<br />\r\n\t<br />\r\n\tWhile T3 has been one of the fortunate few publications to be allowed to have a preview of GTA5's sprawling delights, information has been rather thin on the ground about what to expect from the game.<br />\r\n\t<br />\r\n\tWe know there are three protagonists, we know that heists are a new big gameplay feature and we know that this is Rockstar's biggest game to date - set, as it is, in an approximation of the city of Los Angeles and the surrounding countryside. But how does it all fit together?</p>\r\n<p></p>\r\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/N-xHcvug3WI?feature=player_embedded\" width=\"640\"></iframe></p>\r\n<p></p>\r\n<p>Well, hopefully, the above video, recently released by Rockstar, will answer a few questions punters may have. It details not only the size of the game's massive world, but also the activities they can engage in. There's another brief look at the three main protagonists and a slightly more expanded look at the new system detailing heists. Grand Theft Auto 5's online mode is even teased at the end of the clip.<br />\r\n\t<br />\r\n\tGTA 5 is scheduled for release on September 17th for PlayStation 3 and Xbox 360.</p>\r\n\n\n","summary":"\r\n\tThe first Grand Theft Auto 5 gameplay footage has been shown off in a new video released by Rockstar Games.","categories":["game demo","Games","Gaming","GTA","GTA V","gta v","teasers","General"],"author":"Nick Cowen","pubDate":"2013-07-09T06:26:51.000Z"},{"guid":"squitto-360-degree-ball-camera-you-can-literally-throw-away","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/squitto.jpg","title":"Squitto! A 360-degree ball camera you can literally throw away","description":"\n<h3>\r\n\tA panoramic throwable camera with search and rescue qualities, the Squito has a 360-degree view that can be used for search and rescue missions or just for fun.</h3>\r\n<!--break-->\r\n<p>Ever wanted a camera that you can throw around and not have it crushed into pieces? Squito has come to the rescue! Its inventor, Steve Hollinger, has created a prototype and acquired a patent for a throwable camera that serves as a refreshing update to the one he came up with a few years ago.</p>\r\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/8BYSSKNS5Ks?feature=player_embedded\" width=\"640\"></iframe></p>\r\n<p>Before, the throwable panoramic camera did not have a detailed usage description, but now we can enjoy its features which include being used in the dark, fog, smoke, or at night. It has video stabilization built-in (which means you still get usable video even if the ball is rotating like crazy). It can even be used in a fire rescue, and it has wireless infrared with collaborative stitching properties (gathering and stitching together images from several Squitos) as well. So it's not just for some vanity \"look at me shot from above\" kind of footage. It can save lives too.</p>\r\n<p>Its design is more appealing than its predecessor, not to mention the variety of capabilities the test unit demonstrates. Any gadget that can be used to watch an infrared video or be used in a fire rescue is sure to be enough to grab the eye of any gadget connoisseur.</p>\r\n<p></p>\r\n<p></p>\r\n\n\n","summary":"\r\n\tA panoramic throwable camera with search and rescue qualities, the Squito has a 360-degree view that can be used for search and rescue missions or just for fun.","categories":["Big Boys Toys","Bond gadgets","Cameras","Gadgets","gadgets","security cameras","surveillance and security","Product Releases"],"author":"micha","pubDate":"2013-07-09T15:35:57.000Z"},{"guid":"unique-muslim-search-engine-halalgoogling-launched","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/halalgoogling.PNG","title":"Unique Muslim search engine Halalgoogling launched","description":"\n<h3>\r\n\tHalal's the way ahead for Web Search. Apparently.</h3>\r\n<!--break-->\r\n<p>\"Our Mission is to satisfy the internet needs of the Muslim community, so each Muslim can surf the web in the Halal way.\" So starts the intro for the Halalgoogling project. &nbsp;Halalgoogling is rather unique in that it is the world’s first unique Muslim search engine with a built-in system to filter “Haram content”, content which is deemed not to respect Muslim culture. Meaning aspects like gambling can take a walk.</p>\r\n<p>We did try a few uummm... inappropriate searches, which came up red flagged.</p>\r\n<p>The site seems to be in Beta, especially the maps side, as it had very restricted destination options. Interesting idea, especially for parents. What is filtered, what represents right and wrong, &nbsp;that we would need to find out.&nbsp;</p>\r\n\n\t\n","summary":"\r\n\tHalal's the way ahead for Web Search. Apparently.","categories":["General"],"author":"Anil George","pubDate":"2013-07-08T14:49:40.000Z"},{"guid":"best-apple-iphone-5-cases-and-covers-2013","type":"features","image":"http://www.t3me.com/sites/default/files/feature/2013/07/cover.jpg","title":"Best Apple iPhone 5 cases and covers 2013","description":"\n<h3>\r\n\tT3 picks the best looking (or most practical) iPhone 5 cases and covers available in 2013 to keep your precious fruit phone snug as a bug in a rug. <a href=\"http://t3me.com/category/tags/covers\" target=\"_system\">Got a Galaxy S4? We got you \"covered\"</a> as well (geddit?)</h3>\r\n<!--break-->\r\n<p></p>\r\n\n\t<table>\n\t<tr>\t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/feature/2013/07/xl_Proporta_iPhone_5_case_624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/feature/2013/07/xl_Proporta_iPhone_5_case_624.jpg\" alt=\"Proporta iPhone 5 Leather case\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>Proporta iPhone 5 Leather case</h3>\n\t\t\t<p>Flipping open like the business phones of old, this is a serious-looking case for suited folk. Constructed partly from aluminium to absorb knocks and drops, there's a soft black and cream pinstripe lining and also comes with a free screen protector.<br />\r\n</p>\r\n<p></p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/feature/2013/07/xl_Cygnett_Urbanshield_624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/feature/2013/07/xl_Cygnett_Urbanshield_624.jpg\" alt=\"Cygnett UrbanShield\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>Cygnett UrbanShield</h3>\n\t\t\t<p>If Apple’s most beautiful product bar none is simply not beautiful enough, you may want to invest in this sleek case offering from Australian case-maker Cygnett. Available in a choice of brushed aluminium and carbon fiber, the slimline shell will add a sleek, but understated look to the new iPhone with access to the camera to shoot freely from its snug surroundings.<br />\r\n</p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/feature/2013/07/xl_Belkin_View_Case_624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/feature/2013/07/xl_Belkin_View_Case_624.jpg\" alt=\"Belkin View Case\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>Belkin View Case</h3>\n\t\t\t<p>Perfect for those who want to flaunt their shiny new iPhone 5 in the faces of Android lovers, the View Case sports a transparent polycarbonate back and features a protective band around the edges that is made from a scratch-protecting TPU material. &nbsp;<br />\r\n</p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/feature/2013/07/xl_Otterbox_Defender_iPhone_5_.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/feature/2013/07/xl_Otterbox_Defender_iPhone_5_.jpg\" alt=\"Otterbox Defender Series\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>Otterbox Defender Series</h3>\n\t\t\t<p>Tough case experts Otterbox is bringing its three-pronged protection to the iPhone 5 offering durable multi-layered polycarbonate and silicone materials that covers screen, back and sides and will guard not only against bumps and bruises but also against your mucky mitts.<br />\r\n</p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/feature/2013/07/xl_Belkin_Ease_Fit_Plus_Armban.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/feature/2013/07/xl_Belkin_Ease_Fit_Plus_Armban.jpg\" alt=\"Belkin ProFit Armband\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>Belkin ProFit Armband</h3>\n\t\t\t<p>Whether MiCoach, Nike+ or Endomondo is your running app of choice, if you’re investing in the iPhone 5, you are going to need to accommodate that extra screen estate. With an adjustable closure to prevent constant fiddling, there’s also a small pocket to keep your key or enough loose change for a bottle of Lucozade.<br />\r\n</p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/feature/2013/07/xl_Dicota_iPhone_5_cases_624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/feature/2013/07/xl_Dicota_iPhone_5_cases_624.jpg\" alt=\"Dicota Slim Cover\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>Dicota Slim Cover</h3>\n\t\t\t<p>If you want to maintain the iPhone 5’s slender form but stay protected from house keys and loose change in your pocket, the slim cover will add just 0.88mm in thickness and also help prevent daily damage to your Apple smartphone. You can take your pick from blue, black, white or transparent shades of the slimline case.<br />\r\n</p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/feature/2013/07/xl_Calypso_Case_Rainbow_624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/feature/2013/07/xl_Calypso_Case_Rainbow_624.jpg\" alt=\"CalypsoCase Rainbow\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>CalypsoCase Rainbow</h3>\n\t\t\t<p>If you are willing to spend a bit more on a more luxurious mobile home for the iPhone 5, CalypsoCase has joined forces with designer Lara Bohnic to bring her unique style to its latest handcrafted cases which include the ‘Rainbow’ made from a fashionista-loving glossy leather with silver finishing.<br />\r\n</p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/feature/2013/07/xl_lifeproof case 624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/feature/2013/07/xl_lifeproof case 624.jpg\" alt=\"LifeProof Frē\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>LifeProof Frē</h3>\n\t\t\t<p class=\"rteleft\">LifeProof claims that the Frē case is the most advanced ever built. It offers incredibly comprehensive, military grade elemental protection for your iPhone 5, along with good looks and a few colour choices. Not only that, the Lifeproof case protects your camera lense with CrystalClear glass, ensuring that your photos remain, well... crystal clear.</p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/feature/2013/07/xl_incipio atlas 624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/feature/2013/07/xl_incipio atlas 624.jpg\" alt=\"Incipio ATLAS\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>Incipio ATLAS</h3>\n\t\t\t<p class=\"rteleft\">The ATLAS - due for release in February 2013 - is waterproof, dustproof, snowproof, drop-proof, shockproof and, probably lots of other things... proof. It's waterproof to a depth of 2m, for around an hour, making it not quite as waterproof as the LifeProof case, or the Seidio OBEX. But what it lacks on that front, it makes up for with striking design.</p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/feature/2013/07/xl_hitcase 624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/feature/2013/07/xl_hitcase 624.jpg\" alt=\"HitcasePRO\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>HitcasePRO</h3>\n\t\t\t<p class=\"rteleft\">Hitcase has been around for a while if you're an iPhone 4/4S user, but at CES the hardcase manufacturers confirmed that the Hitcase would be available for iPhone 5 on March 1st. The Hitcase covers the entirety of your iPhone, protecting it from all manner of dangerous situations, as well as being waterproof to 10 metres. It even comes with a harness for GoPro-esque shenanigans.</p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/feature/2013/07/xl_kickBack-sport-624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/feature/2013/07/xl_kickBack-sport-624.jpg\" alt=\"Scosche kickBACK Sport\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>Scosche kickBACK Sport</h3>\n\t\t\t<p class=\"rteleft\">An integrated kickstand makes FaceTime calling and movie watching a doddle, whilst the shock-resistant polycarbonate exterior offers protection during active workouts. A sweat, dirt, oil and abrasion-resistant material ensures this is the ideal case for those with an active lifestyle.</p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/xl_SnuggCover-624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/xl_SnuggCover-624.jpg\" alt=\"Snugg case\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>Snugg case</h3>\n\t\t\t<p class=\"rteleft\">There is nothing worse than pulling out your shiny, new iPhone and noticing a scratch on that beautiful glass rear or a dirty rub mark on the aluminium antenna. The Snugg Skinny fit iPhone provides a rubberised silicone designed to ‘hug’ your iPhone giving it comforting protection without sacrificing any of the slim design.</p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/xl_Incipio-Feather-624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/xl_Incipio-Feather-624.jpg\" alt=\"Incipio Feather\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>Incipio Feather</h3>\n\t\t\t<p class=\"rteleft\">A barely-noticeable, 1mm thin, ultra strong polymer case for those who want protection from house keys and loose change. Slightly larger (0.12mm) than the Dicota Slim Cover, but the opaque charcoal grey colour way retains the sleek design as Apple intended it.</p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/xl_Griffin-Explorer-Survivor-624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/xl_Griffin-Explorer-Survivor-624.jpg\" alt=\"Griffin Explorer\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>Griffin Explorer</h3>\n\t\t\t<p class=\"rteleft\">With a shatter-resistant polycarbonate frame surrounded in a rugged, shock-absorbing silicone, Griffin’s Survivor collection protects from more than just the daily commute: dirt, sand, rain, shock and vibration are all left in the wake of apocalypse-enduring protector. And it's available in a whopping 294 colour combos.</p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/xl_Gear4-Wave-624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/xl_Gear4-Wave-624.jpg\" alt=\"Gear4 Wave\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>Gear4 Wave</h3>\n\t\t\t<p class=\"rteleft\">A simple clip-on case from Gear4 provides access to all the necessary external buttons and new Lightning charge port. Most importantly, the cover itself looks great with a grooved wave design.</p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/xl_Casemate-creatures-624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/xl_Casemate-creatures-624.jpg\" alt=\"Case-Mate Creatures\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>Case-Mate Creatures</h3>\n\t\t\t<p class=\"rteleft\">Available in Monkey, Peacock, Penguin and Panda flavours, these fun, colourful cases feature easy-to-hold grips to ensure that no iPhone's were harmed during the making of this case. Features a raised bezel that adds extra screen protection</p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/xl_XDoria-Dash-624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/xl_XDoria-Dash-624.jpg\" alt=\"X-Doria Dash\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>X-Doria Dash</h3>\n\t\t\t<p class=\"rteleft\">The only iPhone case with a window. The X-Doria Dash combines a glossy polycarbonate with a unique, perforated fabric that looks visually striking but provides all the necessary protection for your new iPhone.</p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/xl_seidio obex 624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/xl_seidio obex 624.jpg\" alt=\"Seidio OBEX\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>Seidio OBEX</h3>\n\t\t\t<p class=\"rteleft\">The OBEX is designed to make sure you're pride and joy never gets so much as a scratch of damage, however badly you treat it. Rubber Silicone stoppers keep dust and liquids out of the key ports, whilst waterproof membranes protect the speakers and microphones without hurting the quality of your calls.</p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/xl_mara-hoffman-incase-624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/xl_mara-hoffman-incase-624.jpg\" alt=\"Incase x Mara Hoffman Snap case\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>Incase x Mara Hoffman Snap case</h3>\n\t\t\t<p class=\"rteleft\">The iPhone 5 is a beautiful device, but it does lack a bit of colour. Brighten up your prized possession with this Incase snap case, with added artwork from uber trendy New York designer, Mara Hoffman.</p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/xl_beamhaus-pocket-624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/xl_beamhaus-pocket-624.jpg\" alt=\"Griffin Beamhaus Pocket\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>Griffin Beamhaus Pocket</h3>\n\t\t\t<p class=\"rteleft\">Encase your iPhone in this suede lined, leather clad beauty. You know it deserves it. Along with being stylish, the Beamhaus Pocket is also practical, with a nifty slot for cards or spare cash and even comes in its own carrying pouch.</p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/xl_iphone-5-lego-case-624-1.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/xl_iphone-5-lego-case-624-1.jpg\" alt=\"Belkin Lego Builder case\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>Belkin Lego Builder case</h3>\n\t\t\t<p class=\"rteleft\">Release your inner child and add a tad of creativity to your iPhone 5, while protecting it from unwanted bumps. Shock absorbent and scratch resistance features aside, this case from Belkin also lets you add classic Lego bricks right on its back.</p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/xl_proporta-ted-baker-iphone-5-624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/xl_proporta-ted-baker-iphone-5-624.jpg\" alt=\"Proporta Ted Baker cases\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>Proporta Ted Baker cases</h3>\n\t\t\t<p class=\"rteleft\">This is a nice slim case that will protect from light bumps and scrapes - but Ted Baker is the star of the show here. The Autumn/Winter collection uses natty floral regalia, for those who are more than comfortable with their sexuality.</p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/xl_iFoolish-2-624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/xl_iFoolish-2-624.jpg\" alt=\"iFoolish 2 case\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>iFoolish 2 case</h3>\n\t\t\t<p class=\"rteleft\">There are plenty of polycarbonate protective cases out there, but there's only one that has an 4-inch drawing board on the back. There's also a pen that fits nicely into the case, so you can amuse yourself on the tube, or leave messages for your friends.</p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/xl_tavik-pentak-624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/xl_tavik-pentak-624.jpg\" alt=\"Tavik Pentry\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>Tavik Pentry</h3>\n\t\t\t<p class=\"rteleft\">Form-fitting Plexitonium hugs the curves of your precious iPhone, protecting it from bumps and scrapes - as per your usual silicone case. This one also comes with a full alphabet's worth of letters to insert into the back, so you can spell out a five letter word of your choice.</p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/xl_casemate-madison-624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/xl_casemate-madison-624.jpg\" alt=\"Case-Mate Madison\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>Case-Mate Madison</h3>\n\t\t\t<p class=\"rteleft\">Though not the most protective cover we've seen for a phone, the Madison makes up for it with chic styling, thanks to tthe quilted leather casing finished with Swarovski crystal inserts. Also, there is a soft, microfibre lining - so you're not totally helpless if your phone slips from your grasp.</p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/xl_casemate-wood-624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/xl_casemate-wood-624.jpg\" alt=\"Case-Mate Artistry Wood\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>Case-Mate Artistry Wood</h3>\n\t\t\t<p class=\"rteleft\">These cases start off as a piece of exotic hardwood - sourced in a manner most friendly to the environment of course - before having a thin aluminium bezel added. Simple and elegant. You can chose from a variety of woods, and all have an inlay to help protect your phone from impacts.</p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/xl_pantone bookcase 624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/xl_pantone bookcase 624.jpg\" alt=\"2013: Pantone Universe Bookcase\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>2013: Pantone Universe Bookcase</h3>\n\t\t\t<p class=\"rteleft\">Clearly iPad Bookcase inspired, the Pantone Universe Bookcase folds out and lets you view your iPhone in a portrait or landscape viewing position, as well as dressing your iPhone 5 up in a smart variety of colours.</p>\r\n\t\t</td>\n    </tr>\n</table>\n","summary":"\r\n\tT3 picks the best looking (or most practical) iPhone 5 cases and covers available in 2013 to keep your precious fruit phone snug as a bug in a rug. Got a Galaxy S4? We got you \"covered\" as well (geddit?)","categories":["Apple accessories","Best Of","Covers","iPhone 5","phone accessories","Phone Accessories","phone cases","Phones"],"author":"Simon Khoury","pubDate":"2013-07-08T07:49:55.000Z"},{"guid":"ea-next-gen-tablet-games-match-ps3-and-xbox-360-graphics-quality","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/Apple-ipad-mini-624-1.jpg","title":"EA: Next-gen tablet games to match PS3 and Xbox 360 graphics quality","description":"\n<h3>\r\n\tAccording to EA Labels president Frank Gibeau in an interview with <a href=\"http://uk.ign.com/articles/2013/07/03/ea-next-tablets-will-have-nearly-ps3-quality-graphics\" target=\"_system\">IGN</a>, the \"next wave\" of gaming on tablets and mobile devices will be able to take on the same graphics capabilities as the PS3 and Xbox 360.</h3>\r\n<!--break-->\r\n<p>During the interview Gibeau stated, \"Some of our engine technology that used to be console-specific now can, with modifications, be able to power games on tablets and on phones in the near future.\"</p>\r\n<p>EA have been working on developing DICE's Frostbite games engine to translate to iOS and Android gaming.</p>\r\n<p>Although in development, there are complications in bringing current gen graphic design to mobile and tablet gaming.</p>\r\n<p>Gibeau expresses it's not as easy as just bringing it over, \"You have to re-architect it around touch, voice, camera. Our teams are having a lot of fun with that, reimagining an experience on a tablet using the same graphics and assets in some ways, but completely remixing the meal.\"</p>\r\n<p>Earlier this year EA announced that they would not be producing any new titles for the Nintendo Wii U.</p>\r\n<p>The announcement came just two weeks after DICE exec revealed that Wii U struggles on Frostbite 2, so Frostbite 3 engine games such as Mass Effect 4, Dragon Age III: Inquisition, and Battlefield 4 would not be coming to Wii U.</p>\r\n<p></p>\r\n<p><strong>Source</strong>: <a href=\"http://uk.ign.com/articles/2013/07/03/ea-next-tablets-will-have-nearly-ps3-quality-graphics\" target=\"_system\">IGN</a></p>\r\n<p></p>\r\n\n\n","summary":"\r\n\tAccording to EA Labels president Frank Gibeau in an interview with IGN, the \"next wave\" of gaming on tablets and mobile devices will be able to take on the same graphics capabilities as the PS3 and Xbox 360.","categories":["EA Games","ea games","games 2013","Gaming Industry","Tablets","General"],"author":"Grace Dean","pubDate":"2013-07-08T06:12:44.000Z"},{"guid":"apple%E2%80%99s-app-store-now-holding-top-games-and-apps-free","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/apppp.jpg","title":"Apple’s App Store is now holding the top games and apps for free","description":"\n<h3>\r\n\tThe dream of being able to download games and apps from the App Store will be coming true in a couple of days.</h3>\r\n<!--break-->\r\n<p><span style=\"line-height: 20px;\">Upon celebrating its 5-year anniversary this week, Apple’s App Store is discounting your favorite games, like Infinity Blade II and Badland, for free, completely. This is sure to get the company many ‘Happy Anniversary’ wishes.</span></p>\r\n<p>Mobile devices can continue to give their praises to Apple as well, for bringing about higher-quality applications since July 10.</p>\r\n<p>Since the revolutionary creation of the APP Store, total apps available reached a record of 900,000 with a staggering 50 billion apps downloaded. We will be waiting for the amount of apps available to possibly hit the one million mark soon. &nbsp;</p>\r\n<p>Even though the full list of games to be available for free has yet to be released, the games should be named in the next two days. Until then, you’re going to have to keep your patience and take a look at the ones that you want.&nbsp;</p>\r\n\n\n","summary":"\r\n\tThe dream of being able to download games and apps from the App Store will be coming true in a couple of days.","categories":["App Store","Apple","Apple Games","Apps - Software","Deals","iOS","iPhone apps","iTunes","Phone Apps","General"],"author":"micha","pubDate":"2013-07-08T14:52:27.000Z"},{"guid":"life-logging-may-be-possible-smartphones-using-saga-app","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/saga.png","title":"Life-logging may be possible on smartphones using the Saga app","description":"\n<h3>\r\n\tThe Saga app, known to capture each move you make, will soon be available on smartphones to simplify the process of life-logging.</h3>\r\n<!--break-->\r\n<p>Currently, engineers from the company that has brought about this app, ARO, is creating the technology to make it possible to use a barometer, microphones, cameras and even the location sensors on the phone, to know where someone is and what they’re doing.</p>\r\n<p>The new approach to the app is said to be available in the early fall or late summer. The good news about running the app on your phone is that it does not take up too much of the phone’s battery. It is only expected to take up around 1% of the mobile’s battery while conducting the background activities.</p>\r\n<p>A person’s motion is itself a trigger for the app in the instance where their device’s accelerometer claims that the person is not in stand-still. Checking someone’s location is therefore activated when they’re in motion.</p>\r\n<p>You can presently find the app available free of charge on iOS and Android so you can get close perceptions of your daily activities. In addition to tracking your acts on a daily basis, you can get data from other social networking databases like FitBit.</p>\r\n<p>At the moment, tests are being conducted to internally test the application so it can be adapted on Android devices as well. This is being done through testing a device’s microphone so a person’s acts are made known.</p>\r\n<p>As chief components of sound and light are being sampled, Saga could officially be capable of keeping record of your life automatically.</p>\r\n\n\n","summary":"\r\n\tThe Saga app, known to capture each move you make, will soon be available on smartphones to simplify the process of life-logging.","categories":["Doug Engelbart","Android","Android apps","android apps","Apps - Software","iOS","iOS apps","iPhone apps","Phone Apps","General"],"author":"micha","pubDate":"2013-07-08T14:45:54.000Z"},{"guid":"instagram-adds-landscape-mode-photos-and-gives-ios-cinema-mode","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/instagram.jpg","title":"Instagram adds the landscape mode for photos and gives iOS the cinema mode","description":"\n<h3>\r\n\tAdding a landscape orientation to Instagram photos is finally an option.</h3>\r\n<!--break-->\r\n<p><span style=\"line-height: 20px;\">If you’re an iPhone-owner, you’re probably among the countless Apple customers who have complained at least one point or another about not being able to apply a landscape mode on Instagram, but now, the wait for your pleas to be answered is over.</span></p>\r\n<p>Known for its versatile settings to help make memories, Instagram has finally added a landscape mode to its photo settings. The app already allows taking photos and videos with added filter features, which include being able to give a photo a dated look.</p>\r\n<p>Until now, with the added landscape orientation, the online photo and video sharing app is only available on iOS. Instagram could always grab photos with a square shape with an added rotation function, but if you decide to turn an Apple device sideways, now, the photo menu can be oriented accordingly.</p>\r\n<p>Find Instagram’s 4.0.2 update in Apple’s App Store today.</p>\r\n<p>In addition to the landscape mode, Instagram has added an update for front-facing cameras used for video shots: cinema mode. The cinema feature is reserved exclusively for Apple’s products: the iPhone, iPod Touch, and iPad.</p>\r\n<p>So, for those using Android, you’re going to have to wait a bit longer to have the new added Instagram capabilities.&nbsp;</p>\r\n\n\n","summary":"\r\n\tAdding a landscape orientation to Instagram photos is finally an option.","categories":["Apps - Software","Instagram","iOS","iOS apps","iPhone apps","Phone Apps","Social Media","updates","General"],"author":"micha","pubDate":"2013-07-08T12:48:06.000Z"},{"guid":"it-moto-x-or-droid-maxx-twitter-has-answer","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/Motorola-DROID-MAXX-Emerges-in-Leaked-Press-Photo.jpg","title":"Is it the Moto X or Droid Maxx? Twitter has the answer","description":"\n<h3>\r\n\tWhat appeared to have been a <a href=\"http://www.t3me.com/news/phones/smartphones/android-phones/google-reveal-motorola-moto-x-11th-of-july\" target=\"_system\">sneak-peak leak of the Moto X</a>, in fact turned out to be the new member of the Droid family.</h3>\r\n<!--break-->\r\n<p>Wondering what’s new from the infamous EVLeaks (Twitter leaker)? Apparently the well-informedtweeter posted a leaked press photo this weekend showing what you may suspect to be the new Motorola phone: Moto X.</p>\r\n<p>Don’t be fooled (like we and many others were). If you look closely, you’ll notice that the shot in fact shows the up-and-coming Droid Maxx. As a novel interpretation of Google’s Droid brand, which undergoes several appearances worldwide, the Maxx comes to replace the Droid Razor Maxx, introduced last year.</p>\r\n<p>Good news for carbon-fiber loyalists, the new version of the Razor Maxx still seems to hold a carbon fiber cover. Since it’s a tad challenging to spot the actual phone dimensions from the leaked picture, we can only assume that the phone’s bezel is slimmer than its earlier forms.</p>\r\n<p>Ever since the company came out with its first QWERTY-based Android handsets, the Droid line has become very popular. Currently, it is even more prevalent among Motorola fans who have disregarded the slight decrease in Droid’s heat recently.</p>\r\n<p>Besides the leaked shot of the new phone from EVLeaks, really nothing else has been revealed to discern additional enhancements or changes.</p>\r\n<p>However, seeing as how Motorola has made a great shift into Google, launching further additions like a Droid handset to the line would serve as an advantage to fulfil customer curiosity.</p>\r\n<p>Despite certain assumptions that Google may not continue collaborating with Motorola on new devices, for now launchings are still on the table. So, it’s worth looking into any future probable releases.&nbsp;</p>\r\n\n\n","summary":"\r\n\tWhat appeared to have been a sneak-peak leak of the Moto X, in fact turned out to be the new member of the Droid family.","categories":["Android","Android phones","Android Phones","Droid Maxx","Google","Moto X","Motorola","Motorola X","motorola X","Phones","SmartPhones","Product Releases"],"author":"micha","pubDate":"2013-07-08T11:49:18.000Z"},{"guid":"budget-iphone-here","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/xl_budget.jpg","title":"The budget iPhone is here!","description":"\n<h3>\r\n\t<span style=\"line-height: 20px;\">Or is it? Leaked images show what could be the final form of the budget iPhone, in 5 color variants, including a rather garish green</span></h3>\r\n<!--break-->\r\n<p><span style=\"line-height: 20px;\">When it comes to a low cost iPhone, the ‘If’s have been replaced by ‘When?’s. We’d reported earlier on how Apple had scaled up production in anticipation for the low cost budget phone. And apparently, this will be coming to town by the September-October timeframe seen during the past two years, along with the iPhone 5S.&nbsp;</span></p>\r\n<p><span style=\"line-height: 20px;\">Techdy reports that it has gotten its hands on what it believes to be legitimate front and rear parts for this lower-cost plastic iPhone, offering the first good look at how the device will appear fully assembled. Among the most obvious differences from previous assumptions is the use of a black panel for the device as opposed to white. Techdy tells us that this black front panel will be used with all color variations of the rear shell, which will reportedly include blue, pink, yellow, green, and white. The color variations, let’s be honest, do sound more economy than business.</span></p>\r\n<p>“The budget iPhone will be made substantially from plastic (we can feel it’s actually polycarbonate material). It will have a 4” screen, like the iPhone 5, and interestingly, the budget iPhone actually has a shape that’s similar to Apple’s original iPod. When we hold the budget iPhone in our hands, the plastic chassis does not feel cheap at all. Unlike the plastic build quality of the Samsung Galaxy phones, the plastic material used on the budget iPhone feels more sturdy.” are the words of wisdom from the site. Techdy has even created a $199 Android-powered clone of the device called the Basic Bear, running on Android 4.2 Jelly Bean, 16GB storage, 4-inch display and 1.7GHz quad-core snapdragon 600 CPU, which not surprisingly, is scheduled to begin shipping in September.</p>\r\n<p>So now, let’s await that moment, two months away, when the iPhone and iOS shall officially go mass.</p>\r\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"http://www.t3me.com//www.youtube.com/embed/3TQE45A_2Qw\" width=\"560\"></iframe></p>\r\n\n\t\n","summary":"\r\n\tOr is it? Leaked images show what could be the final form of the budget iPhone, in 5 color variants, including a rather garish green","categories":["iPhone 5","Apple","budget devices","cheap iphone","iPhone","Phones","SmartPhones","General"],"author":"Anil George","pubDate":"2013-07-07T10:11:43.000Z"},{"guid":"apple-iphone-5s-release-date-features-specs-and-rumours","type":"features","image":"http://www.t3me.com/sites/default/files/iphone5s-rumor2_0.jpg","title":"Apple iPhone 5S release date, features, specs and rumours","description":"\n<div>\r\n\t<h3>\r\n\t\tThe Apple iPhone 5S release date could be as soon as September 2013, with the phone tipped to feature a fingerprint scanner, NFC, Full HD and different colours.</h3>\r\n</div>\r\n<!--break-->\r\n<div>\r\n</div>\r\n<p>When it comes to smartphones, the first few months of 2013 moved the proverbial goalposts. Android handsets flourished with Full HD screens, aluminium or glass unibodies and every feature under the sun.</p>\r\n<p>Apple’s iPhone 5 has been on the scene for a while now but its thunder is in danger of being stolen by the Android Army.</p>\r\n<p>The question we all want to know is what will Apple do next? With Cupertino updating the iPad 3 just months after releasing it, there are reports that an iPad Mini 2 or even an Apple TV could be on the way.</p>\r\n<p>What we know for sure though, is that the company will want to reclaim its smartphone crown. So, T3 has gathered together everything we know about the rumoured iPhone 5S.<br />\r\n</p>\r\n<h3>\r\n\t<strong>Apple iPhone 5S casing </strong></h3>\r\n<p>A range of leaked images have poured onto the net showing brightly coloured devices reported to be the so-called <a href=\"http://www.t3me.com/category/story-stream/cheap-iphone\" target=\"_system\">iPhone Light</a>. French website <a href=\"http://www.nowhereelse.fr/iphone-plastique-couleur-rouge-85172/\" target=\"_system\">NoWhereElse</a> posted the images that share similar physical traits to the iPod Nano.</p>\r\n<p>Its exterior is said to be plastic polycarbonate and much more economical to build suggesting that Apple are aiming at a younger target market or at least consumers with less disposable income.</p>\r\n<p>The devices come in blue, green, yellow, red and white yet Apple unsurprisingly has remained quiet on the subject with nothing being confirmed. Leaked schematics and blueprints also report that the Light is a bit thicker and wider than the iPhone 5.</p>\r\n<p><img alt=\"\" src=\"http://origin.media.t3.com/img/resized/ip/xl_iPhone-5S-colour-cases-leak-624.jpg\" style=\"width: 420px; height: 236px; margin-top: 10px; margin-bottom: 10px;\" /></p>\r\n<p>With two types of chasis being leaked one could come to the conclusion that Apple might retain the same metal design for the iPhone 6 whilst the iPhone 5S will now come sporting this cheaper plastic body</p>\r\n<p>Up until now, Apple hasn’t strayed from the white/black colour scheme for its phones but Topeka Capital Research analyst Brian White has said he believes that along with different colours, the iPhone 5S may arrive in different sizes.</p>\r\n<p>This appears to be backed up by Japanese tech site <a href=\"http://www.macotakara.jp/blog/rumor/entry-19718.html\" target=\"_system\">Macotakara</a> which also believes the iPhone 5S will have three extra colours added to the black or white standard.</p>\r\n<p>If Apple launched three models, for example with 3.5-inch, 4-inch and 5-inch screens, it would allow the company to grab both premium and budget customers.</p>\r\n<p>However, this could be more of a plan for the iPhone 6 with Apple surely looking to compete with the larger handsets out there like the Galaxy Note 2 and the <a href=\"http://www.t3me.com/category/story-stream/xperia-z-ultra\" target=\"_system\">Xperia Z Ultra</a>. At the bare minimum, we’d expect to see a better camera (although don’t expect ultrapixels, HTC One-style) and a faster processor.<br />\r\n</p>\r\n<h3>\r\n\t<strong>Apple iPhone 5S specs</strong></h3>\r\n<p>When it comes to the specs of the next iPhone, at the very least we expect Apple to use the A6X chip currently found in the latest iPad. However, the latest rumours suggest Apple could be working on an A7 chip for the forthcoming iPad 5.</p>\r\n<p>In years gone by, Apple has previously worked with Samsung to produce processors for it's iPhone range. But, given the recent legal tussels between the two companies, many speculate that Apple will want to distance itself from the Korean company. Some rumours have hinted at an Intel chip being included in the next iteration of the iPhone.</p>\r\n<p>Some purported images of iPhone 5S prototypes appear to show a change in the hardware configuration that suggests Apple is moving things around to make space for a bigger battery or extra features such as NFC.</p>\r\n<p>Apple famously decided to withhold NFC for the iPhone 5 and since both the <a href=\"http://t3me.com/category/free-tags/galaxy-s3\" target=\"_system\">Samsung Galaxy S3</a> and <a href=\"http://t3me.com/category/free-tags/galaxy-s4\" target=\"_system\">Samsung Galaxy S4</a> have arrived toting the new connectivity, Apple may want to incorporate it this time around.</p>\r\n<p>Recent reports from Taiwan and tech website <a href=\"http://www.nfcworld.com/\" target=\"_system\">NFC World</a> indicate that manufacturer Chipbond has won a major contract to build components for the iPhone 5S - including NFC. What's more, other rumours suggest that Apple will go further and include a fingerprint scanner in the iPhone 5S, adding in extra security.</p>\r\n<p>In terms of storage, there is the strong possibility of Apple launching a new phone with 128GB storage – similar to the latest iPad upgrade.</p>\r\n<p>Meanwhile Jeffries analyst Peter Misek told <a href=\"http://www.businessinsider.com/\" target=\"_system\">Business Insider</a> that he believes the iPhone 5S will feature a “Super HD screen” along with a range of colours similar to the iPod Touch range. Considering all the top Android handsets feature Full HD displays, we reckon its unlikely Apple will launch the iPhone 5S with anything less than a 1,920 x 1,080 pixel resolution.<br />\r\n</p>\r\n<h3>\r\n\t<strong>Apple iPhone 5S camera</strong></h3>\r\n<p>It’s well known that one of the key battlegrounds of smartphone warfare is the specifications of the on-board camera. The Sony Xperia Z and Galaxy S4 arrived sporting 13MP cameras while HTC upset the apple cart by including a 4MP “ultrapixel” camera into its HTC One handset.</p>\r\n<p>Apple has consistently upped the camera specs in each of its models and its no stretch to think that the company will do the same for the iPhone 5S. According to <a href=\"http://www.ilounge.com/index.php/backstage/comments/a-few-more-ipad-5-iphone-5s-and-ipad-mini-2g-details/\" target=\"_system\">iLounge</a>, Cupertino isn’t planning to go down the HTC route and will instead launch the 5S with a 13MP camera – putting it in league with the Sony and Samsung handsets.</p>\r\n<p>Of course, hardware is only half the story and if Apple can come up with some killer in-house apps to take advantage of the camera in new ways it will give them a good start on the competition.<br />\r\n</p>\r\n<h3>\r\n\t<strong>Apple iPhone 5S pictures</strong></h3>\r\n<p>A few interesting pictures have leaked out onto the web regarding the iPhone 5S. One of the first to emerge was the back of an unspecified type of iPhone that was leaked to <a href=\"http://nowhereelse.fr/\" target=\"_system\">Nowhereelse.fr</a>.</p>\r\n<p>There’s not much to go on here, but – as expected – the casing and design looks almost identical to the iPhone 5. Tellingly though, the serial numbers underneath the iPhone moniker aren’t listed.</p>\r\n<p>While it would certainly fit with the design of the current iPhone it doesn't yet confirm whether the 5S will come in a range of colours - much like it did with the iPod Touch - or whether the company will simply stick to the black/white variants.</p>\r\n<p>This second image (pictured at the start of this article) apparently shows stripped-down iPhone 5S casing next to a current iPhone 5 teardown image. The snap was initially uploaded to iPhone4Parts and looks very similar to Apple’s current design – except with a few screws lost along the way.</p>\r\n<p><img alt=\"\" src=\"http://origin.media.t3.com/img/resized/ip/xl_iPhone-5S-concept-624.jpg\" style=\"width: 420px; height: 236px; margin-top: 10px; margin-bottom: 10px;\" /></p>\r\n<h3>\r\n\t<strong>Apple iPhone 5S release date</strong></h3>\r\n<p>Plenty of sources have weighed in with opinions on when the iPhone 5S and the overriding good news is that it appears to be sooner rather than later. For the most part, the majority of rumours hinged on late summer as the likely date for the new phone.</p>\r\n<p><a href=\"http://www.businessinsider.com/iphone-5s-production-2013-5\" target=\"_system\">Business Insider</a> recently came across reports that the new iPhone 5S will be enter production in June 2013. Manufacturers like Sharp, LG and JapanDisplay are said to be constructing displays for the new hanset and the actual device itself may arrive in \"the Fall\".</p>\r\n<p>This would be in line with Apple's announcement at WWDC 2013 where the company unveiled its new mobile operating system iOS</p>\r\n<p>Still, fingers crossed, eh?</p>\r\n<p></p>\r\n\n\n","summary":"\r\n\t\tThe Apple iPhone 5S release date could be as soon as September 2013, with the phone tipped to feature a fingerprint scanner, NFC, Full HD and different colours.","categories":["Apple","Apple rumors","Editorials","iPhone","iPhone 5S","Phones","SmartPhones"],"author":"Michael Sawh","pubDate":"2013-07-06T10:09:52.000Z"},{"guid":"t3-imagines-ultimate-smartphone-3d-render-video","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/t3-ultimate-phone.jpg","title":"T3 imagines the Ultimate Smartphone in 3D render [video]","description":"\n<h3>\r\n\tWe have created the ultimate smartphone. Ok so not literally but what we have done is taken the best aspects from the best smartphones around today - HTC's One, Samsung's Galaxy S4, Sony's Xperia Z, and Nokia's upcoming EOS Lumia 1020 - and blended them together to create what we think would be the greatest smartphone you could possibly buy.</h3>\r\n<!--break-->\r\n<p></p>\r\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/h0VpAB9MjZQ?feature=player_embedded\" width=\"640\"></iframe></p>\r\n<p></p>\r\n<p>To make sure it ran as well as it looked we took two brand-new quad-core Qualcomm Snapdragon 800 chips and combined them with a ludicrous 16GB RAM and 128GB of storage (ok so we got a bit carried away with that one).<br />\r\n\t<br />\r\n\tA sleek aluminium body comes courtesy of the<a href=\"http://t3me.com/category/free-tags/iphone-5\" target=\"_system\"> iPhone 5</a> and the <a href=\"http://t3me.com/category/free-tags/htc-one\" target=\"_system\">HTC One</a> both of which boast stunning aluminiun designs which not only look good but make them sturdier.<br />\r\n\t<br />\r\n\tBoomSound stereo speakers come courtesy of the HTC One whilst on the back there's the 41MP PureView camera which Nokia showcased on the 808 PureView.<br />\r\n\t<br />\r\n\tWe haven't stopped there though, thanks to some inspiration from the <a href=\"http://www.t3me.com/category/story-stream/xperia-z-ultra\" target=\"_system\">Sony Xperia Z Ultra</a> we've made it IP57 water-resistant and dustproof whilst the icing on the cake?<br />\r\n\t<br />\r\n\tTurn the phone on its side and a laser keyboard will project down onto any surface removing the need to use those pesky small keyboards. Oh and if you can't decide between iOS 7 and Android 4.2, you won't have to as this will dual-boot.<br />\r\n\t<br />\r\n\tThis wasn't all us though, T3 asked YouTube viewers what they'd like to see on the ultimate smartphone and using those ideas we were able to create this.<br />\r\n\t<br />\r\n\tSo now we're asking you, our readers, did we miss anything out? Like the design? Hate it? If you could change anything what would it be? Start the deabte on our official <a href=\"http://www.facebook.com/T3.MiddleEast\" target=\"_system\">T3 Facebook page</a> or on <a href=\"http://twitter.com/t3me\" target=\"_system\">Twitter</a>.</p>\r\n\n\n","summary":"\r\n\tWe have created the ultimate smartphone. Ok so not literally but what we have done is taken the best aspects from the best smartphones around today - HTC's One, Samsung's Galaxy S4, Sony's Xperia Z, and Nokia's upcoming EOS Lumia 1020 - and blended them together to create what we think would be the greatest smartphone you could possibly buy.","categories":["3D","Phones","SmartPhones","T3 exclusive","t3 features","Video","General"],"author":"T3 Middle East","pubDate":"2013-07-06T09:59:20.000Z"},{"guid":"google-reveal-motorola-moto-x-11th-of-july","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/Motorola-Moto-X-google-Advert-624.jpg","title":"Google to reveal the Motorola Moto X on 11th of July","description":"\n<h3>\r\n\tThe Motorola Moto X will not only be Google's first true 'Google phone' but it'll also be the first major smartphone since the search engine bought the smartphone company.</h3>\r\n<!--break-->\r\n<p>Motorola has unveiled its first advert for the <a href=\"http://www.t3me.com/category/story-stream/motorola-x\" target=\"_system\">Motorola Moto X</a> with both the advert and outside sources suggesting that Google's first own-brand smartphone will be getting unveiled next week.</p>\r\n<p>According PhoneArena.com technology broadcaster Leo Laporte has said that he was invited by new Morotola employee Guy Kawasaki to one of their events on July 10<sup>th</sup> and 11<sup>th</sup>.</p>\r\n<p>It’s unclear what exactly the event would be about however Kawasaki apparently emphasised that it was an event for selected tech journalists and that it was going to be something quite important.</p>\r\n<p>This is after Motorola recently released their promotional ad featuring two people diving off a wooden dock, which according to an observant tech-reader might be representing the roman numerals XI meaning 11. At this point this is merely analytical speculation however the coincidental press event does highlight suspicion.&nbsp;</p>\r\n<p>It is also possible that the event will reveal more details on the Motorola Droid RAZR Ultra devices that have been long in the pipeline however its likely that if rumours are true, the day will solely focus on the Moto X.</p>\r\n<p>Despite previously reported leaks, the Moto X will not feature top of the line hardware but will got head-to-head with other mid market devices. It will have a Qualcomm MSM8960 Pro dual-core processor marked at 1.7GHz.</p>\r\n<p>As far as software goes it will be running on Android 4.2.2 Jelly Bean, the latest version of the operating system. &nbsp;</p>\r\n<p>Leaked specifications have also suggested a 720p display with no word of screen size. The Moto X will pack a 10 megapixel camera on back along with a 2 megapixel on the front – reasonably stacking it against other current mid-range devices.&nbsp;</p>\r\n<p>The phone is also said to carry 2GB of Ram and 16GB of internal storage.</p>\r\n<p>Motorola CEO Dennis Woodside discussed the Moto X at an AllThingsD event in May, saying it would be made in an old Nokia factory outside Fort Worth, Texas, and will be very sensor-based.</p>\r\n<p>“The new phone will know when you take it out of your pocket, for example,” said Woodside. “It anticipates my needs.”<br />\r\n</p>\r\n<p><strong>Source: </strong><a href=\"http://www.phonearena.com/news/Expect-official-word-about-the-Motorola-Moto-X-on-July-11th_id44938\" target=\"_system\">Phonearena</a></p>\r\n<p></p>\r\n\n\n","summary":"\r\n\tThe Motorola Moto X will not only be Google's first true 'Google phone' but it'll also be the first major smartphone since the search engine bought the smartphone company.","categories":["Android","Android Phones","Google","Moto X","Motorola","Motorola X","motorola X","Phones","SmartPhones","General"],"author":"T3 Middle East","pubDate":"2013-07-06T09:41:35.000Z"},{"guid":"halo-4-best-selling-game-published-microsoft-studios","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/xl_halo-4-chief-624.jpg","title":"Halo 4 best selling game published by Microsoft Studios","description":"\n<h3>\r\n\tMicrosoft has revealed that Halo 4 is the best selling game ever published by Microsoft Studios in the US.</h3>\r\n<!--break-->\r\n<p>The company announced that 343 Industries’ first foray into the Halo franchise has topped Halo 3 “for sales during each respective launch year”.</p>\r\n<p>That means that the title has so far sold more than Halo 3 during its first 12 months, but it has not topped overall sales yet.</p>\r\n<p>Bungie retired from the Halo series it created following the release of Halo 3: OSDT.</p>\r\n<p>Major Nelson also <a href=\"http://majornelson.com/2013/07/03/halo-4-global-championship-announced-500000-in-prizes-are-on-the-line/\" target=\"_system\">announced</a> that The Halo 4 Global Championship is planned for later this summer.</p>\r\n<p>According to the Microsoft exec, it will be competed in across a mix of live and online events.</p>\r\n<p>A total of $500,000 in prizes will be available, with the winner walking away with $200,000 alone.</p>\r\n<p>The event kicks off this weekend at Rooster Teeth Expo in Austin, Texas. Play offs will begin on Xbox Live from July 15th.<br />\r\n</p>\r\n<p><strong>Via:</strong> <a href=\"http://www.mcvuk.com/news/read/microsoft-halo-4-top-selling-ms-studios-game-of-all-time-in-us/0118099\" target=\"_system\">MCV</a></p>\r\n\n\n","summary":"\r\n\tMicrosoft has revealed that Halo 4 is the best selling game ever published by Microsoft Studios in the US.","categories":["Game Charts","Gaming","Halo","Microsoft","Xbox","General"],"author":"Ben Furfie","pubDate":"2013-07-06T08:13:58.000Z"},{"guid":"international-htc-one-gets-android-422-jelly-bean","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/htc-one-x-jelly-bean.jpg","title":"The International HTC One gets the Android 4.2.2 Jelly Bean","description":"\n<h3>\r\n\tMost of you who own the international version of the HTC One do not have to wait that long for the arrival of the Android 4.2.2 Jelly Bean.</h3>\r\n<!--break-->\r\n<p><span style=\"line-height: 20px;\">With the new arrival of the 4.2.2 Jelly Bean, you can now enjoy a considerable amount of updates ranging from a better Launcher bar to enhanced home button performance.</span></p>\r\n<p>HTC’s One is a relevant success which is foreseen to be additionally successful through the Android 4.2.2 update.</p>\r\n<p>In addition to the mentioned enhancements, new features include a novel lock screen arrangement, rearrangements to the widget, along with the choice of showing the level of the phone’s battery along the status bar. Not to mention its automatic qualities like auto-focus lock and auto-exposure found on the camera viewfinder.</p>\r\n<p>The international unit in Taiwan was found to already have the update, according to <em>AndroidCentral</em>. This is a precursor of what to expect for other international models as well. The United States, however, may not be among the first to inhabit the advancement seeing as how its regulations still require that the update go through carrier testing. So what does this mean for companies like AT&amp;T, T-Mobile, and Sprint? They will just have to wait a bit longer.</p>\r\n<p><em>AndroidCentral</em> is suspecting the launch of the HTC One with the Android 4.2.2 for Verizon. Although, there is still not enough verification at the present time to confirm the speculation.</p>\r\n<p></p>\r\n\n\n","summary":"\r\n\tMost of you who own the international version of the HTC One do not have to wait that long for the arrival of the Android 4.2.2 Jelly Bean.","categories":["Android","Android Phones","Android updates","HTC One","Jelly Bean","Phones","SmartPhones","General"],"author":"micha","pubDate":"2013-07-04T13:18:13.000Z"},{"guid":"5-of-best-google-reader-replacements-your-rss-fix-here","type":"features","image":"http://www.t3me.com/sites/default/files/feature/2013/07/newsblur-624.jpg","title":"5 of the best Google Reader replacements: Your RSS fix here","description":"\n<h3>\r\n\tDid the retirement of Google Reader leave you in a state of RSS blues? Or even worse, unable to keep up with the interwebs? Fear not, T3 trawled the web for the best 5 RSS reader alternatives.</h3>\r\n<!--break-->\r\n<p>Gallery below at your disposal.</p>\r\n\n\t<table>\n\t<tr>\t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/feature/2013/07/1-feedly-624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/feature/2013/07/1-feedly-624.jpg\" alt=\"1. Feedly\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>1. Feedly</h3>\n\t\t\t<p class=\"rtejustify\">Possibly the service most tipped to take over from Google Reader, Feedly has already benefited from its demise, bringing in a host of new features and users to boot. It’s the simple approach that makes it highly recommendable; just log in with your old Google Reader account and all your feeds will return, shown in a modern, slick and picture centric view. Feedly also has companion apps for both iOS and Android so wherever you are you’ll be up-to-date.</p>\r\n<p class=\"rtejustify\"><strong>Link</strong>: <a href=\"http://cloud.feedly.com/#welcome\" target=\"_system\">Feedly</a></p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/feature/2013/07/2-digg-624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/feature/2013/07/2-digg-624.jpg\" alt=\"2. Digg Reader\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>2. Digg Reader</h3>\n\t\t\t<p class=\"rtejustify\">Digg reader, while not as feature rich as Feedly, is much more visually simple. Its two column view is bare, yet shows all your updates in an easy to read manner. It has efficient keyboard shortcuts for power users and a nifty popular tab to see what other people are reading. If you’re a big fan of Instapaper, Digg could be the reader for you as both are operated by Betaworks so the integration is seamless.</p>\r\n<p class=\"rtejustify\"><strong>Link</strong>: <a href=\"http://digg.com/reader\" target=\"_system\">Digg Reader</a></p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/feature/2013/07/aol-reader-624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/feature/2013/07/aol-reader-624.jpg\" alt=\"3. AOL Reader \" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>3. AOL Reader </h3>\n\t\t\t<p class=\"p1 rtejustify\">While still in Beta, AOL Reader is purpose built as a Google Reader replacement. Again, it offers migration from your old accounts and a plethora of sharing options. Its interface is straightforward, with a list of feeds on the left and a picture based view of all your news to the right. As with the other readers, it’s simple and all about delivering and discovering content. Unfortunately app support is lacking and AOL says they have iOS and Android apps on the way, but for now the website displays well enough on mobile devices.</p>\r\n<p class=\"p1 rtejustify\"><strong>Link</strong>: <a href=\"http://reader.aol.com/\" target=\"_system\">AOL Reader </a></p>\r\n<p class=\"lM tL nextPrompt rtejustify\"></p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/feature/2013/07/newsblur-624_0.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/feature/2013/07/newsblur-624_0.jpg\" alt=\"4. NewsBlur \" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>4. NewsBlur </h3>\n\t\t\t<p class=\"rtejustify\">If you want more features for your buck then NewsBlur could be for you. It focuses on delivering content quickly, updating your feeds every minute so you’re never out of the loop. You can view stories on their original site as well as sharing them with others. While it is free for up to 64 feeds, if you’re a power user it’s going to set you back $24 a year for more. It's not be pretty, but its power features are a definite plus.</p>\r\n<p class=\"rtejustify\"><strong>Link</strong>: <a href=\"http://www.newsblur.com/\" target=\"_system\">NewsBlur</a><br />\r\n\t<strong>Price</strong>: $24 a year (for more than 64 feeds)</p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/pulse-reader-624.jpg\" target=\"_system\"><img src=\"http://www.t3me.com/sites/default/files/pulse-reader-624.jpg\" alt=\"5. Pulse\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>5. Pulse</h3>\n\t\t\t<p class=\"rtejustify\">Pulse has been around for a while as a mobile app, but now they’re making a push for the online space. Big pictures are the name of the game, and Pulse puts striking images front and centre. The set up is easy too, enabling you to quickly populate your feeds with news topics such as sport or technology. Google Reader importing is also supported to make a pretty complete package, but probably one for the casual user.</p>\r\n<p class=\"rtejustify\"><strong>Link</strong>: <a href=\"http://www.pulse.me/\" target=\"_system\">Pulse</a></p>\r\n\t\t</td>\n    </tr>\n</table>\n","summary":"\r\n\tDid the retirement of Google Reader leave you in a state of RSS blues? Or even worse, unable to keep up with the interwebs? Fear not, T3 trawled the web for the best 5 RSS reader alternatives.","categories":["Apps - Software","Computer Software","Google","Google Reader","Internet","Monthly","Productivity","RSS","Web and Social Media"],"author":"Simon Khoury","pubDate":"2013-07-04T13:11:12.000Z"},{"guid":"gears-of-war-producer-quits-work-mass-effect-4","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/xl_Mass Effect 3.jpg","title":"Gears of War producer quits to work on Mass Effect 4","description":"\n<h3>\r\n\tWith work on the Xbox One and PS4 title already underway Epic Games’ Chris Wynn announced via Twitter that he will be joining BioWare to focus on the Mass Effect 4.</h3>\r\n<!--break-->\r\n<p>After working as lead producer on Gears of War 3 and Senior Producer on <a href=\"http://www.t3.com/reviews/gears-of-war-judgment-review\" target=\"_system\">Gears of War: Judgment</a>, Chris Wynn is set to exit Epic Games and join BioWare as Senior Development Director on the next installment in the Mass Effect series.&nbsp;</p>\r\n<p>Wynn tweeted \"Thrilled to announce that I will be joining BioWare as the Sr. Development Director on the next Mass Effect!” &nbsp;&nbsp;</p>\r\n<p>His exit follows the recent trend of senior staff members that have departed Epic, including designer Cliff Bleszinki and producer Rod Fergusson.</p>\r\n<p>Little is known about the sequel to the critically acclaimed <a href=\"http://www.t3me.com/reviews/gaming/games/mass-effect-3-depth-review\" target=\"_system\">Mass Effect 3</a> with details being kept under wraps however we do know that it will use the Frostbite 3 engine, much like Dragon Age: Inquisition.</p>\r\n<p>According to a report by IGN Frostbite is capable of providing the “Highest standard of immersion in entertainment” by utilizing an “Unmatched level of visual and audio fidelity”. The game engine also has the ability to improve character animations as well as dynamic environments&nbsp;</p>\r\n<p>BioWare Montreal executive producer Casey Hudson revealed in March that work has begun on the third-person shooter and that it will not be a direct sequel to the 2012 hit.&nbsp;</p>\r\n<p>He said: “We are starting to get ready to develop another <em>Mass Effect</em> game, and it's going to be a new thing. We want to be able to give fans an opportunity to get back into the world with these things you've come to know and love about the <em>Mass Effect</em> experience, but start something fresh and new; a new way for you to explore the whole universe in <em>Mass Effect</em>”</p>\r\n<p>The release date of Mass Effect 4 has not yet been announced by Electronic Arts.</p>\r\n\n\n","summary":"\r\n\tWith work on the Xbox One and PS4 title already underway Epic Games’ Chris Wynn announced via Twitter that he will be joining BioWare to focus on the Mass Effect 4.","categories":["Bioware","Epic","Games","Gaming","Gears of War","Mass Effect","General"],"author":"T3 Middle East","pubDate":"2013-07-04T12:25:34.000Z"},{"guid":"samsung-postpones-its-first-tizen-smartphone","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/Tizen-Logo_fixed.jpg","title":"Samsung postpones its first Tizen smartphone","description":"\n<h3>\r\n\tThe much-awaited release of the first Tizen smartphone from Samsung has been delayed.</h3>\r\n<!--break-->\r\n<p><span style=\"line-height: 20px;\">The launch of the Tizen OS, supported by Samsung and Intel, has been postponed for about two months after it was supposed to debut by Samsung sometime in August.</span></p>\r\n<p>The delay is mainly due to some concerns Samsung was having with the OS, particularly with the App Store itself. According to both designers of the app outlet, Intel and Samsung, the Store is not yet ready to head out into the market since there is a still a need for tweaking along with adding additional applications. Regardless, many are still unconvinced about the launch of Tizen.</p>\r\n<p>This OS is not the first try by Samsung to develop its own operating system. Its first try was with Bada, which although was not that successful, didn’t do so bad. However, Samsung’s Wave handsets will have a positive effect since after all, by the end of 2011, they brought a $10 million revenue to the company. This means that the Tizen will have a better chance to show-up the Bada by a significantly large margin.</p>\r\n<p>However, regardless of its flexibility, the Tizen will still face some challenges in the market. This is especially the case in terms of competition, seeing as how the Tizen is among other up-and-coming mobile operating systems. The most notable competitors today include the just recently launched Firefox OS and the popular Ubuntu Mobile.</p>\r\n<p>So be sure to stay posted on how these three systems will manage among one another in the OS world.&nbsp;</p>\r\n\n\n","summary":"\r\n\tThe much-awaited release of the first Tizen smartphone from Samsung has been delayed.","categories":["Phones","Samsung","Smart Phones","SmartPhones","Tizen OS","Product Releases"],"author":"micha","pubDate":"2013-07-04T10:35:46.000Z"},{"guid":"new-app-lets-you-easily-reserve-and-pay-parking-dubai","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/mpark-parking-sms-dubai-uae-2.jpg","title":"New app lets you easily reserve and pay for parking in Dubai","description":"\n<h3>\r\n\tNo more fumbling for your car registration number, zone number, and drafting tangled SMS messages. Developer GadgetCheck is hoping his mPark app will simplify parking, namely in Dubai...</h3>\r\n<!--break-->\r\n<p>Having a tough time finding parking in any city is a commonplace problem so why not use an app that minimizes that hassle? This may not be an option yet for your region, but it may well be soon.</p>\r\n<p><img align=\"bottom\" alt=\"T3 Middle East\" src=\"http://t3me.com/sites/default/files/pictures/2013/quick/Banner_graphics_new.jpg\" style=\"border-width: 0px; border-style: solid; margin: 5px; height: 195px; width: 400px;\" /></p>\r\n<p>mPark is an SMS-based parking system that allows you to reserve a spot and pay for it via a text message, and is employed in several major cities around the world. But looking for your car registration number and your spot zone while being late for a meeting isn't something you would want to do.</p>\r\n<p>Now meet the mPark app by GadgetCheck. It only works for Dubai denizens at the moment, but it simplifies the process of finding and reserving parking berth for your vehicle.</p>\r\n<p>The app memorizes your car's tag number (several cars can be saved in advance). You then pick your parking zone, and choose a parking spot plus the amount of time you prefer to have it saved for. The app crafts the tedious SMS message for you, and you're done. Go ace that interview!</p>\r\n<p>You can get the aptly named <a href=\"https://play.google.com/store/apps/details?id=com.simrge.mpark\" target=\"_system\">mPark app fron Android's Play Store</a>. The developer says he might add more cities soon, so make sure to follow the active development thread over at XDA-Developers.</p>\r\n<p></p>\r\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/5H3LLgERkLA?feature=player_embedded\" width=\"640\"></iframe></p>\r\n\n\n","summary":"\r\n\tNo more fumbling for your car registration number, zone number, and drafting tangled SMS messages. Developer GadgetCheck is hoping his mPark app will simplify parking, namely in Dubai...","categories":["android apps","Android apps","Apps - Software","Cars","Dubai","Phone Apps","UAE","General"],"author":"T3 Middle East","pubDate":"2013-07-04T09:04:22.000Z"}]}]