[{"date":"2013-07-08T10:00:36.192Z","articles":[{"guid":"apple-iphone-5s-release-date-features-specs-and-rumours","type":"features","image":"http://www.t3me.com/sites/default/files/iphone5s-rumor2_0.jpg","title":"Apple iPhone 5S release date, features, specs and rumours","description":"\n<div>\r\n\t<h3>\r\n\t\tThe Apple iPhone 5S release date could be as soon as September 2013, with the phone tipped to feature a fingerprint scanner, NFC, Full HD and different colours.</h3>\r\n</div>\r\n<!--break-->\r\n<div>\r\n</div>\r\n<p>When it comes to smartphones, the first few months of 2013 moved the proverbial goalposts. Android handsets flourished with Full HD screens, aluminium or glass unibodies and every feature under the sun.</p>\r\n<p>Apple’s iPhone 5 has been on the scene for a while now but its thunder is in danger of being stolen by the Android Army.</p>\r\n<p>The question we all want to know is what will Apple do next? With Cupertino updating the iPad 3 just months after releasing it, there are reports that an iPad Mini 2 or even an Apple TV could be on the way.</p>\r\n<p>What we know for sure though, is that the company will want to reclaim its smartphone crown. So, T3 has gathered together everything we know about the rumoured iPhone 5S.<br />\r\n</p>\r\n<h3>\r\n\t<strong>Apple iPhone 5S casing </strong></h3>\r\n<p>A range of leaked images have poured onto the net showing brightly coloured devices reported to be the so-called <a href=\"http://www.t3me.com/category/story-stream/cheap-iphone\" target=\"_blank\">iPhone Light</a>. French website <a href=\"http://www.nowhereelse.fr/iphone-plastique-couleur-rouge-85172/\" target=\"_blank\">NoWhereElse</a> posted the images that share similar physical traits to the iPod Nano.</p>\r\n<p>Its exterior is said to be plastic polycarbonate and much more economical to build suggesting that Apple are aiming at a younger target market or at least consumers with less disposable income.</p>\r\n<p>The devices come in blue, green, yellow, red and white yet Apple unsurprisingly has remained quiet on the subject with nothing being confirmed. Leaked schematics and blueprints also report that the Light is a bit thicker and wider than the iPhone 5.</p>\r\n<p><img alt=\"\" src=\"http://origin.media.t3.com/img/resized/ip/xl_iPhone-5S-colour-cases-leak-624.jpg\" style=\"width: 420px; height: 236px; margin-top: 10px; margin-bottom: 10px;\" /></p>\r\n<p>With two types of chasis being leaked one could come to the conclusion that Apple might retain the same metal design for the iPhone 6 whilst the iPhone 5S will now come sporting this cheaper plastic body</p>\r\n<p>Up until now, Apple hasn’t strayed from the white/black colour scheme for its phones but Topeka Capital Research analyst Brian White has said he believes that along with different colours, the iPhone 5S may arrive in different sizes.</p>\r\n<p>This appears to be backed up by Japanese tech site <a href=\"http://www.macotakara.jp/blog/rumor/entry-19718.html\">Macotakara</a> which also believes the iPhone 5S will have three extra colours added to the black or white standard.</p>\r\n<p>If Apple launched three models, for example with 3.5-inch, 4-inch and 5-inch screens, it would allow the company to grab both premium and budget customers.</p>\r\n<p>However, this could be more of a plan for the iPhone 6 with Apple surely looking to compete with the larger handsets out there like the Galaxy Note 2 and the <a href=\"http://www.t3me.com/category/story-stream/xperia-z-ultra\">Xperia Z Ultra</a>. At the bare minimum, we’d expect to see a better camera (although don’t expect ultrapixels, HTC One-style) and a faster processor.<br />\r\n</p>\r\n<h3>\r\n\t<strong>Apple iPhone 5S specs</strong></h3>\r\n<p>When it comes to the specs of the next iPhone, at the very least we expect Apple to use the A6X chip currently found in the latest iPad. However, the latest rumours suggest Apple could be working on an A7 chip for the forthcoming iPad 5.</p>\r\n<p>In years gone by, Apple has previously worked with Samsung to produce processors for it's iPhone range. But, given the recent legal tussels between the two companies, many speculate that Apple will want to distance itself from the Korean company. Some rumours have hinted at an Intel chip being included in the next iteration of the iPhone.</p>\r\n<p>Some purported images of iPhone 5S prototypes appear to show a change in the hardware configuration that suggests Apple is moving things around to make space for a bigger battery or extra features such as NFC.</p>\r\n<p>Apple famously decided to withhold NFC for the iPhone 5 and since both the <a href=\"http://t3me.com/category/free-tags/galaxy-s3\">Samsung Galaxy S3</a> and <a href=\"http://t3me.com/category/free-tags/galaxy-s4\">Samsung Galaxy S4</a> have arrived toting the new connectivity, Apple may want to incorporate it this time around.</p>\r\n<p>Recent reports from Taiwan and tech website <a href=\"http://www.nfcworld.com/\">NFC World</a> indicate that manufacturer Chipbond has won a major contract to build components for the iPhone 5S - including NFC. What's more, other rumours suggest that Apple will go further and include a fingerprint scanner in the iPhone 5S, adding in extra security.</p>\r\n<p>In terms of storage, there is the strong possibility of Apple launching a new phone with 128GB storage – similar to the latest iPad upgrade.</p>\r\n<p>Meanwhile Jeffries analyst Peter Misek told <a href=\"http://www.businessinsider.com/\">Business Insider</a> that he believes the iPhone 5S will feature a “Super HD screen” along with a range of colours similar to the iPod Touch range. Considering all the top Android handsets feature Full HD displays, we reckon its unlikely Apple will launch the iPhone 5S with anything less than a 1,920 x 1,080 pixel resolution.<br />\r\n</p>\r\n<h3>\r\n\t<strong>Apple iPhone 5S camera</strong></h3>\r\n<p>It’s well known that one of the key battlegrounds of smartphone warfare is the specifications of the on-board camera. The Sony Xperia Z and Galaxy S4 arrived sporting 13MP cameras while HTC upset the apple cart by including a 4MP “ultrapixel” camera into its HTC One handset.</p>\r\n<p>Apple has consistently upped the camera specs in each of its models and its no stretch to think that the company will do the same for the iPhone 5S. According to <a href=\"http://www.ilounge.com/index.php/backstage/comments/a-few-more-ipad-5-iphone-5s-and-ipad-mini-2g-details/\">iLounge</a>, Cupertino isn’t planning to go down the HTC route and will instead launch the 5S with a 13MP camera – putting it in league with the Sony and Samsung handsets.</p>\r\n<p>Of course, hardware is only half the story and if Apple can come up with some killer in-house apps to take advantage of the camera in new ways it will give them a good start on the competition.<br />\r\n</p>\r\n<h3>\r\n\t<strong>Apple iPhone 5S pictures</strong></h3>\r\n<p>A few interesting pictures have leaked out onto the web regarding the iPhone 5S. One of the first to emerge was the back of an unspecified type of iPhone that was leaked to <a href=\"http://nowhereelse.fr/\">Nowhereelse.fr</a>.</p>\r\n<p>There’s not much to go on here, but – as expected – the casing and design looks almost identical to the iPhone 5. Tellingly though, the serial numbers underneath the iPhone moniker aren’t listed.</p>\r\n<p>While it would certainly fit with the design of the current iPhone it doesn't yet confirm whether the 5S will come in a range of colours - much like it did with the iPod Touch - or whether the company will simply stick to the black/white variants.</p>\r\n<p>This second image (pictured at the start of this article) apparently shows stripped-down iPhone 5S casing next to a current iPhone 5 teardown image. The snap was initially uploaded to iPhone4Parts and looks very similar to Apple’s current design – except with a few screws lost along the way.</p>\r\n<p><img alt=\"\" src=\"http://origin.media.t3.com/img/resized/ip/xl_iPhone-5S-concept-624.jpg\" style=\"width: 420px; height: 236px; margin-top: 10px; margin-bottom: 10px;\" /></p>\r\n<h3>\r\n\t<strong>Apple iPhone 5S release date</strong></h3>\r\n<p>Plenty of sources have weighed in with opinions on when the iPhone 5S and the overriding good news is that it appears to be sooner rather than later. For the most part, the majority of rumours hinged on late summer as the likely date for the new phone.</p>\r\n<p><a href=\"http://www.businessinsider.com/iphone-5s-production-2013-5\">Business Insider</a> recently came across reports that the new iPhone 5S will be enter production in June 2013. Manufacturers like Sharp, LG and JapanDisplay are said to be constructing displays for the new hanset and the actual device itself may arrive in \"the Fall\".</p>\r\n<p>This would be in line with Apple's announcement at WWDC 2013 where the company unveiled its new mobile operating system iOS</p>\r\n<p>Still, fingers crossed, eh?</p>\r\n<p></p>\r\n\n\n","summary":"\r\n\t\tThe Apple iPhone 5S release date could be as soon as September 2013, with the phone tipped to feature a fingerprint scanner, NFC, Full HD and different colours.","categories":["Apple","Apple rumors","Editorials","iPhone","iPhone 5S","Phones","SmartPhones"],"author":"Michael Sawh","pubDate":"2013-07-06T10:09:52.000Z"},{"guid":"t3-imagines-ultimate-smartphone-3d-render-video","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/t3-ultimate-phone.jpg","title":"T3 imagines the Ultimate Smartphone in 3D render [video]","description":"\n<h3>\r\n\tWe have created the ultimate smartphone. Ok so not literally but what we have done is taken the best aspects from the best smartphones around today - HTC's One, Samsung's Galaxy S4, Sony's Xperia Z, and Nokia's upcoming EOS Lumia 1020 - and blended them together to create what we think would be the greatest smartphone you could possibly buy.</h3>\r\n<!--break-->\r\n<p></p>\r\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/h0VpAB9MjZQ?feature=player_embedded\" width=\"640\"></iframe></p>\r\n<p></p>\r\n<p>To make sure it ran as well as it looked we took two brand-new quad-core Qualcomm Snapdragon 800 chips and combined them with a ludicrous 16GB RAM and 128GB of storage (ok so we got a bit carried away with that one).<br />\r\n\t<br />\r\n\tA sleek aluminium body comes courtesy of the<a href=\"http://t3me.com/category/free-tags/iphone-5\"> iPhone 5</a> and the <a href=\"http://t3me.com/category/free-tags/htc-one\">HTC One</a> both of which boast stunning aluminiun designs which not only look good but make them sturdier.<br />\r\n\t<br />\r\n\tBoomSound stereo speakers come courtesy of the HTC One whilst on the back there's the 41MP PureView camera which Nokia showcased on the 808 PureView.<br />\r\n\t<br />\r\n\tWe haven't stopped there though, thanks to some inspiration from the <a href=\"http://www.t3me.com/category/story-stream/xperia-z-ultra\">Sony Xperia Z Ultra</a> we've made it IP57 water-resistant and dustproof whilst the icing on the cake?<br />\r\n\t<br />\r\n\tTurn the phone on its side and a laser keyboard will project down onto any surface removing the need to use those pesky small keyboards. Oh and if you can't decide between iOS 7 and Android 4.2, you won't have to as this will dual-boot.<br />\r\n\t<br />\r\n\tThis wasn't all us though, T3 asked YouTube viewers what they'd like to see on the ultimate smartphone and using those ideas we were able to create this.<br />\r\n\t<br />\r\n\tSo now we're asking you, our readers, did we miss anything out? Like the design? Hate it? If you could change anything what would it be? Start the deabte on our official <a href=\"http://www.facebook.com/T3.MiddleEast\">T3 Facebook page</a> or on <a href=\"http://twitter.com/t3me\">Twitter</a>.</p>\r\n\n\n","summary":"\r\n\tWe have created the ultimate smartphone. Ok so not literally but what we have done is taken the best aspects from the best smartphones around today - HTC's One, Samsung's Galaxy S4, Sony's Xperia Z, and Nokia's upcoming EOS Lumia 1020 - and blended them together to create what we think would be the greatest smartphone you could possibly buy.","categories":["3D","Phones","SmartPhones","T3 exclusive","t3 features","Video","General"],"author":"T3 Middle East","pubDate":"2013-07-06T09:59:20.000Z"},{"guid":"google-reveal-motorola-moto-x-11th-of-july","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/Motorola-Moto-X-google-Advert-624.jpg","title":"Google to reveal the Motorola Moto X on 11th of July","description":"\n<h3>\r\n\tThe Motorola Moto X will not only be Google's first true 'Google phone' but it'll also be the first major smartphone since the search engine bought the smartphone company.</h3>\r\n<!--break-->\r\n<p>Motorola has unveiled its first advert for the <a href=\"http://www.t3me.com/category/story-stream/motorola-x\" target=\"_blank\">Motorola Moto X</a> with both the advert and outside sources suggesting that Google's first own-brand smartphone will be getting unveiled next week.</p>\r\n<p>According PhoneArena.com technology broadcaster Leo Laporte has said that he was invited by new Morotola employee Guy Kawasaki to one of their events on July 10<sup>th</sup> and 11<sup>th</sup>.</p>\r\n<p>It’s unclear what exactly the event would be about however Kawasaki apparently emphasised that it was an event for selected tech journalists and that it was going to be something quite important.</p>\r\n<p>This is after Motorola recently released their promotional ad featuring two people diving off a wooden dock, which according to an observant tech-reader might be representing the roman numerals XI meaning 11. At this point this is merely analytical speculation however the coincidental press event does highlight suspicion.&nbsp;</p>\r\n<p>It is also possible that the event will reveal more details on the Motorola Droid RAZR Ultra devices that have been long in the pipeline however its likely that if rumours are true, the day will solely focus on the Moto X.</p>\r\n<p>Despite previously reported leaks, the Moto X will not feature top of the line hardware but will got head-to-head with other mid market devices. It will have a Qualcomm MSM8960 Pro dual-core processor marked at 1.7GHz.</p>\r\n<p>As far as software goes it will be running on Android 4.2.2 Jelly Bean, the latest version of the operating system. &nbsp;</p>\r\n<p>Leaked specifications have also suggested a 720p display with no word of screen size. The Moto X will pack a 10 megapixel camera on back along with a 2 megapixel on the front – reasonably stacking it against other current mid-range devices.&nbsp;</p>\r\n<p>The phone is also said to carry 2GB of Ram and 16GB of internal storage.</p>\r\n<p>Motorola CEO Dennis Woodside discussed the Moto X at an AllThingsD event in May, saying it would be made in an old Nokia factory outside Fort Worth, Texas, and will be very sensor-based.</p>\r\n<p>“The new phone will know when you take it out of your pocket, for example,” said Woodside. “It anticipates my needs.”<br />\r\n</p>\r\n<p><strong>Source: </strong><a href=\"http://www.phonearena.com/news/Expect-official-word-about-the-Motorola-Moto-X-on-July-11th_id44938\" target=\"_blank\">Phonearena</a></p>\r\n<p></p>\r\n\n\n","summary":"\r\n\tThe Motorola Moto X will not only be Google's first true 'Google phone' but it'll also be the first major smartphone since the search engine bought the smartphone company.","categories":["Android","Android Phones","Google","Moto X","Motorola","Motorola X","motorola X","Phones","SmartPhones","General"],"author":"T3 Middle East","pubDate":"2013-07-06T09:41:35.000Z"},{"guid":"halo-4-best-selling-game-published-microsoft-studios","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/xl_halo-4-chief-624.jpg","title":"Halo 4 best selling game published by Microsoft Studios","description":"\n<h3>\r\n\tMicrosoft has revealed that Halo 4 is the best selling game ever published by Microsoft Studios in the US.</h3>\r\n<!--break-->\r\n<p>The company announced that 343 Industries’ first foray into the Halo franchise has topped Halo 3 “for sales during each respective launch year”.</p>\r\n<p>That means that the title has so far sold more than Halo 3 during its first 12 months, but it has not topped overall sales yet.</p>\r\n<p>Bungie retired from the Halo series it created following the release of Halo 3: OSDT.</p>\r\n<p>Major Nelson also <a href=\"http://majornelson.com/2013/07/03/halo-4-global-championship-announced-500000-in-prizes-are-on-the-line/\">announced</a> that The Halo 4 Global Championship is planned for later this summer.</p>\r\n<p>According to the Microsoft exec, it will be competed in across a mix of live and online events.</p>\r\n<p>A total of $500,000 in prizes will be available, with the winner walking away with $200,000 alone.</p>\r\n<p>The event kicks off this weekend at Rooster Teeth Expo in Austin, Texas. Play offs will begin on Xbox Live from July 15th.<br />\r\n</p>\r\n<p><strong>Via:</strong> <a href=\"http://www.mcvuk.com/news/read/microsoft-halo-4-top-selling-ms-studios-game-of-all-time-in-us/0118099\">MCV</a></p>\r\n\n\n","summary":"\r\n\tMicrosoft has revealed that Halo 4 is the best selling game ever published by Microsoft Studios in the US.","categories":["Game Charts","Gaming","Halo","Microsoft","Xbox","General"],"author":"Ben Furfie","pubDate":"2013-07-06T08:13:58.000Z"},{"guid":"international-htc-one-gets-android-422-jelly-bean","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/htc-one-x-jelly-bean.jpg","title":"The International HTC One gets the Android 4.2.2 Jelly Bean","description":"\n<h3>\r\n\tMost of you who own the international version of the HTC One do not have to wait that long for the arrival of the Android 4.2.2 Jelly Bean.</h3>\r\n<!--break-->\r\n<p><span style=\"line-height: 20px;\">With the new arrival of the 4.2.2 Jelly Bean, you can now enjoy a considerable amount of updates ranging from a better Launcher bar to enhanced home button performance.</span></p>\r\n<p>HTC’s One is a relevant success which is foreseen to be additionally successful through the Android 4.2.2 update.</p>\r\n<p>In addition to the mentioned enhancements, new features include a novel lock screen arrangement, rearrangements to the widget, along with the choice of showing the level of the phone’s battery along the status bar. Not to mention its automatic qualities like auto-focus lock and auto-exposure found on the camera viewfinder.</p>\r\n<p>The international unit in Taiwan was found to already have the update, according to <em>AndroidCentral</em>. This is a precursor of what to expect for other international models as well. The United States, however, may not be among the first to inhabit the advancement seeing as how its regulations still require that the update go through carrier testing. So what does this mean for companies like AT&amp;T, T-Mobile, and Sprint? They will just have to wait a bit longer.</p>\r\n<p><em>AndroidCentral</em> is suspecting the launch of the HTC One with the Android 4.2.2 for Verizon. Although, there is still not enough verification at the present time to confirm the speculation.</p>\r\n<p></p>\r\n\n\n","summary":"\r\n\tMost of you who own the international version of the HTC One do not have to wait that long for the arrival of the Android 4.2.2 Jelly Bean.","categories":["Android","Android Phones","Android updates","HTC One","Jelly Bean","Phones","SmartPhones","General"],"author":"micha","pubDate":"2013-07-04T13:18:13.000Z"},{"guid":"5-of-best-google-reader-replacements-your-rss-fix-here","type":"features","image":"http://www.t3me.com/sites/default/files/feature/2013/07/newsblur-624.jpg","title":"5 of the best Google Reader replacements: Your RSS fix here","description":"\n<h3>\r\n\tDid the retirement of Google Reader leave you in a state of RSS blues? Or even worse, unable to keep up with the interwebs? Fear not, T3 trawled the web for the best 5 RSS reader alternatives.</h3>\r\n<!--break-->\r\n<p>Gallery below at your disposal.</p>\r\n\n\t<table>\n\t<tr>\t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/feature/2013/07/1-feedly-624.jpg\"><img src=\"http://www.t3me.com/sites/default/files/feature/2013/07/1-feedly-624.jpg\" alt=\"1. Feedly\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>1. Feedly</h3>\n\t\t\t<p class=\"rtejustify\">Possibly the service most tipped to take over from Google Reader, Feedly has already benefited from its demise, bringing in a host of new features and users to boot. It’s the simple approach that makes it highly recommendable; just log in with your old Google Reader account and all your feeds will return, shown in a modern, slick and picture centric view. Feedly also has companion apps for both iOS and Android so wherever you are you’ll be up-to-date.</p>\r\n<p class=\"rtejustify\"><strong>Link</strong>: <a href=\"http://cloud.feedly.com/#welcome\">Feedly</a></p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/feature/2013/07/2-digg-624.jpg\"><img src=\"http://www.t3me.com/sites/default/files/feature/2013/07/2-digg-624.jpg\" alt=\"2. Digg Reader\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>2. Digg Reader</h3>\n\t\t\t<p class=\"rtejustify\">Digg reader, while not as feature rich as Feedly, is much more visually simple. Its two column view is bare, yet shows all your updates in an easy to read manner. It has efficient keyboard shortcuts for power users and a nifty popular tab to see what other people are reading. If you’re a big fan of Instapaper, Digg could be the reader for you as both are operated by Betaworks so the integration is seamless.</p>\r\n<p class=\"rtejustify\"><strong>Link</strong>: <a href=\"http://digg.com/reader\">Digg Reader</a></p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/feature/2013/07/aol-reader-624.jpg\"><img src=\"http://www.t3me.com/sites/default/files/feature/2013/07/aol-reader-624.jpg\" alt=\"3. AOL Reader \" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>3. AOL Reader </h3>\n\t\t\t<p class=\"p1 rtejustify\">While still in Beta, AOL Reader is purpose built as a Google Reader replacement. Again, it offers migration from your old accounts and a plethora of sharing options. Its interface is straightforward, with a list of feeds on the left and a picture based view of all your news to the right. As with the other readers, it’s simple and all about delivering and discovering content. Unfortunately app support is lacking and AOL says they have iOS and Android apps on the way, but for now the website displays well enough on mobile devices.</p>\r\n<p class=\"p1 rtejustify\"><strong>Link</strong>: <a href=\"http://reader.aol.com/\">AOL Reader </a></p>\r\n<p class=\"lM tL nextPrompt rtejustify\"></p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/feature/2013/07/newsblur-624_0.jpg\"><img src=\"http://www.t3me.com/sites/default/files/feature/2013/07/newsblur-624_0.jpg\" alt=\"4. NewsBlur \" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>4. NewsBlur </h3>\n\t\t\t<p class=\"rtejustify\">If you want more features for your buck then NewsBlur could be for you. It focuses on delivering content quickly, updating your feeds every minute so you’re never out of the loop. You can view stories on their original site as well as sharing them with others. While it is free for up to 64 feeds, if you’re a power user it’s going to set you back $24 a year for more. It's not be pretty, but its power features are a definite plus.</p>\r\n<p class=\"rtejustify\"><strong>Link</strong>: <a href=\"http://www.newsblur.com/\">NewsBlur</a><br />\r\n\t<strong>Price</strong>: $24 a year (for more than 64 feeds)</p>\r\n\t\t</td>\n  \t\t<td>\n\t\t\t<a href=\"http://www.t3me.com/sites/default/files/pulse-reader-624.jpg\"><img src=\"http://www.t3me.com/sites/default/files/pulse-reader-624.jpg\" alt=\"5. Pulse\" width=\"95\" height=\"53\" /></a>\n\t\t\t<h3>5. Pulse</h3>\n\t\t\t<p class=\"rtejustify\">Pulse has been around for a while as a mobile app, but now they’re making a push for the online space. Big pictures are the name of the game, and Pulse puts striking images front and centre. The set up is easy too, enabling you to quickly populate your feeds with news topics such as sport or technology. Google Reader importing is also supported to make a pretty complete package, but probably one for the casual user.</p>\r\n<p class=\"rtejustify\"><strong>Link</strong>: <a href=\"http://www.pulse.me/\">Pulse</a></p>\r\n\t\t</td>\n    </tr>\n</table>\n","summary":"\r\n\tDid the retirement of Google Reader leave you in a state of RSS blues? Or even worse, unable to keep up with the interwebs? Fear not, T3 trawled the web for the best 5 RSS reader alternatives.","categories":["Apps - Software","Computer Software","Google","Google Reader","Internet","Monthly","Productivity","RSS","Web and Social Media"],"author":"Simon Khoury","pubDate":"2013-07-04T13:11:12.000Z"},{"guid":"gears-of-war-producer-quits-work-mass-effect-4","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/xl_Mass Effect 3.jpg","title":"Gears of War producer quits to work on Mass Effect 4","description":"\n<h3>\r\n\tWith work on the Xbox One and PS4 title already underway Epic Games’ Chris Wynn announced via Twitter that he will be joining BioWare to focus on the Mass Effect 4.</h3>\r\n<!--break-->\r\n<p>After working as lead producer on Gears of War 3 and Senior Producer on <a href=\"http://www.t3.com/reviews/gears-of-war-judgment-review\" target=\"_blank\">Gears of War: Judgment</a>, Chris Wynn is set to exit Epic Games and join BioWare as Senior Development Director on the next installment in the Mass Effect series.&nbsp;</p>\r\n<p>Wynn tweeted \"Thrilled to announce that I will be joining BioWare as the Sr. Development Director on the next Mass Effect!” &nbsp;&nbsp;</p>\r\n<p>His exit follows the recent trend of senior staff members that have departed Epic, including designer Cliff Bleszinki and producer Rod Fergusson.</p>\r\n<p>Little is known about the sequel to the critically acclaimed <a href=\"http://www.t3me.com/reviews/gaming/games/mass-effect-3-depth-review\" target=\"_blank\">Mass Effect 3</a> with details being kept under wraps however we do know that it will use the Frostbite 3 engine, much like Dragon Age: Inquisition.</p>\r\n<p>According to a report by IGN Frostbite is capable of providing the “Highest standard of immersion in entertainment” by utilizing an “Unmatched level of visual and audio fidelity”. The game engine also has the ability to improve character animations as well as dynamic environments&nbsp;</p>\r\n<p>BioWare Montreal executive producer Casey Hudson revealed in March that work has begun on the third-person shooter and that it will not be a direct sequel to the 2012 hit.&nbsp;</p>\r\n<p>He said: “We are starting to get ready to develop another <em>Mass Effect</em> game, and it's going to be a new thing. We want to be able to give fans an opportunity to get back into the world with these things you've come to know and love about the <em>Mass Effect</em> experience, but start something fresh and new; a new way for you to explore the whole universe in <em>Mass Effect</em>”</p>\r\n<p>The release date of Mass Effect 4 has not yet been announced by Electronic Arts.</p>\r\n\n\n","summary":"\r\n\tWith work on the Xbox One and PS4 title already underway Epic Games’ Chris Wynn announced via Twitter that he will be joining BioWare to focus on the Mass Effect 4.","categories":["Bioware","Epic","Games","Gaming","Gears of War","Mass Effect","General"],"author":"T3 Middle East","pubDate":"2013-07-04T12:25:34.000Z"},{"guid":"samsung-postpones-its-first-tizen-smartphone","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/Tizen-Logo_fixed.jpg","title":"Samsung postpones its first Tizen smartphone","description":"\n<h3>\r\n\tThe much-awaited release of the first Tizen smartphone from Samsung has been delayed.</h3>\r\n<!--break-->\r\n<p><span style=\"line-height: 20px;\">The launch of the Tizen OS, supported by Samsung and Intel, has been postponed for about two months after it was supposed to debut by Samsung sometime in August.</span></p>\r\n<p>The delay is mainly due to some concerns Samsung was having with the OS, particularly with the App Store itself. According to both designers of the app outlet, Intel and Samsung, the Store is not yet ready to head out into the market since there is a still a need for tweaking along with adding additional applications. Regardless, many are still unconvinced about the launch of Tizen.</p>\r\n<p>This OS is not the first try by Samsung to develop its own operating system. Its first try was with Bada, which although was not that successful, didn’t do so bad. However, Samsung’s Wave handsets will have a positive effect since after all, by the end of 2011, they brought a $10 million revenue to the company. This means that the Tizen will have a better chance to show-up the Bada by a significantly large margin.</p>\r\n<p>However, regardless of its flexibility, the Tizen will still face some challenges in the market. This is especially the case in terms of competition, seeing as how the Tizen is among other up-and-coming mobile operating systems. The most notable competitors today include the just recently launched Firefox OS and the popular Ubuntu Mobile.</p>\r\n<p>So be sure to stay posted on how these three systems will manage among one another in the OS world.&nbsp;</p>\r\n\n\n","summary":"\r\n\tThe much-awaited release of the first Tizen smartphone from Samsung has been delayed.","categories":["Phones","Samsung","Smart Phones","SmartPhones","Tizen OS","Product Releases"],"author":"micha","pubDate":"2013-07-04T10:35:46.000Z"},{"guid":"new-app-lets-you-easily-reserve-and-pay-parking-dubai","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/mpark-parking-sms-dubai-uae-2.jpg","title":"New app lets you easily reserve and pay for parking in Dubai","description":"\n<h3>\r\n\tNo more fumbling for your car registration number, zone number, and drafting tangled SMS messages. Developer GadgetCheck is hoping his mPark app will simplify parking, namely in Dubai...</h3>\r\n<!--break-->\r\n<p>Having a tough time finding parking in any city is a commonplace problem so why not use an app that minimizes that hassle? This may not be an option yet for your region, but it may well be soon.</p>\r\n<p><img align=\"bottom\" alt=\"T3 Middle East\" src=\"http://t3me.com/sites/default/files/pictures/2013/quick/Banner_graphics_new.jpg\" style=\"border-width: 0px; border-style: solid; margin: 5px; height: 195px; width: 400px;\" /></p>\r\n<p>mPark is an SMS-based parking system that allows you to reserve a spot and pay for it via a text message, and is employed in several major cities around the world. But looking for your car registration number and your spot zone while being late for a meeting isn't something you would want to do.</p>\r\n<p>Now meet the mPark app by GadgetCheck. It only works for Dubai denizens at the moment, but it simplifies the process of finding and reserving parking berth for your vehicle.</p>\r\n<p>The app memorizes your car's tag number (several cars can be saved in advance). You then pick your parking zone, and choose a parking spot plus the amount of time you prefer to have it saved for. The app crafts the tedious SMS message for you, and you're done. Go ace that interview!</p>\r\n<p>You can get the aptly named <a href=\"https://play.google.com/store/apps/details?id=com.simrge.mpark\">mPark app fron Android's Play Store</a>. The developer says he might add more cities soon, so make sure to follow the active development thread over at XDA-Developers.</p>\r\n<p></p>\r\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/5H3LLgERkLA?feature=player_embedded\" width=\"640\"></iframe></p>\r\n\n\n","summary":"\r\n\tNo more fumbling for your car registration number, zone number, and drafting tangled SMS messages. Developer GadgetCheck is hoping his mPark app will simplify parking, namely in Dubai...","categories":["android apps","Android apps","Apps - Software","Cars","Dubai","Phone Apps","UAE","General"],"author":"T3 Middle East","pubDate":"2013-07-04T09:04:22.000Z"},{"guid":"canon-releases-eos-70d-camera-replaces-60d","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/Canon EOS 70D.jpg","title":"Canon releases the EOS 70D camera, replaces the 60D","description":"\n<h3>\r\n\tReady to hit the shelves at the end of August, camera-connoisseur Canon has unveiled its newest addition to the EOS series – the EOS 70D.</h3>\r\n<!--break-->\r\n<p>Canon has proved the rumours right by revealing the latest entry in its popular EOS series, the mid-level EOS 70D.<br />\r\n\t<br />\r\n\tBoasted to be the “first Digital SLR in the world to feature Dual Pixel CMOS AF technology” – which in layman’s terms essentially means it delivers a smooth and accurate auto focus when shooting full HD movies and rapid acquisition when shooting in Live View mode.<br />\r\n\t<br />\r\n\tTechnically it’s said to be a ‘huge step-up from the 60D’, with the ability to capture full resolution images at up to 7 frames per second with up to 65 JPEG or 16 RAW images in one single burst. &nbsp;<br />\r\n\t<br />\r\n\tCanon Ambassador Brutus Östling said: “The EOS 70D is the perfect camera for anyone that wants to develop their photography skills. Not only is it suited to shooting people, landscapes and action easily and in outstanding quality, but also filming subjects in Full HD with focus speeds I never thought would be possible”. &nbsp;<br />\r\n\t<br />\r\n\tThis new benchmark is paired with the 14-bit DIGIC 5+ processor and 19-point all cross-type system with a native ISO range of ISO 100-12800.<br />\r\n\t<br />\r\n\tBasically allowing the photographer to shoot in lower light conditions and use fast shutter speeds whilst still retaining the same high image quality – undoubtedly a useful asset.<br />\r\n\t<br />\r\n\tIt packs an impressive 20.2MP sensor combined with a new intelligent viewfinder that will track subjects as they move to automatically align the framing proportionately. Much like its predecessor, the EOS 60D, Wi-FI connectivity is built in to allow users to remotely control the camera via a Smartphone or tablet.<br />\r\n\t<br />\r\n\tThe 70D alone will cost $1,199 but will also be released as part of a kit with an additional 18-55mm STM lens, priced at $1349. Another package also includes an 18-135mm STM lens costing $1549.<br />\r\n\t<br />\r\n\tUntil its release nearer the end of August, Canon expects the EOS 60D to remain on sale for the meantime.</p>\r\n<p></p>\r\n\n\n","summary":"\r\n\tReady to hit the shelves at the end of August, camera-connoisseur Canon has unveiled its newest addition to the EOS series – the EOS 70D.","categories":["Photokina 2012","Cameras","Canon","Canon 70D","DSLRs","Photography","photography","General"],"author":"T3 Middle East","pubDate":"2013-07-03T08:42:26.000Z"},{"guid":"apple-releases-ios-7-beta-version-2","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/06/ios-7.png","title":"Apple releases iOS 7 Beta version 2","description":"\n<h3>\r\n\tApple has released the second <a href=\"http://www.t3me.com/category/story-stream/ios-7\">beta version of iOS 7</a>, this time with support for the iPad.</h3>\r\n<!--break-->\r\n<p>When Apple released the iOS 7 beta earlier this month, it said the iPad version would be made available “soon”.<br />\r\n\t<br />\r\n\tSome developers had already hacked it onto iPad devices, but support wasn’t official.<br />\r\n\t<br />\r\n\tIn addition to being available for the iPad, the second version of the beta brings back support for the voice memo app. Apple had left out support for it in the first version of the iOS 7 beta.<br />\r\n\t<br />\r\n\tIt also features many of the new Siri versions that were previewed at the Worldwide Developers Conference two weeks ago.<br />\r\n\t<br />\r\n\tRegistered developers can update their iOS 7 beta through their iPhones if they have the first version installed.<br />\r\n\t<br />\r\n\tThose developers wanting to install the iOS 7 beta on their iPad will need to do so through iTunes.</p>\r\n<p></p>\r\n\n\n","summary":"\r\n\tApple has released the second <a href=\"http://www.t3me.com/category/story-stream/ios-7\">beta version of iOS 7</a>, this time with support for the iPad.","categories":["Apple","iOS","ios 7","iOS 7","iPhone 5S","Operating Systems","General"],"author":"Ben Furfie","pubDate":"2013-07-02T09:49:19.000Z"},{"guid":"amazons-autorip-gets-you-free-mp3-versions-of-cdsvinyls-you-purchase","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/amazon-autorip-mp3.png","title":"Amazon's AutoRip gets you free MP3 versions of CDs/Vinyls you purchase","description":"\n<h3>\r\n\tIf you’re a customer of music on CDs or Vinyl, you can start downloading the MP3 version of a song for free with Amazon’s new autorip feature.</h3>\r\n<!--break-->\r\n<p>Anyone who decides to buy a song on a CD or Vinyl can also enjoy a free MP3 copy from Amazon’s new service.<br />\r\n\tAlthough the service has been available in the US since January, UK customers can now enjoy the offer - so Dubai residents getting their CD fix from Amazon UK can now try to get a piece of the action as well.<br />\r\n\tIn 1999, the company started the sale of music and emerged with the idea of “autorip” to give customers who buy music on CDs or Vinyl the opportunity to have it on MP3.<br />\r\n\tFollowing years of decline, Amazon has stated that the new service has actually created a rise in CD and Vinyl sales.</p>\r\n<p><br />\r\n\tAutorip is appealing to many customers, according to the head of music of Amazon UK, Paul Firth, who mentioned the benefits customers can take advantage of, including the option of listening to songs of their choice spreading from the physical to digital range.<br />\r\n</p>\r\n\n\n","summary":"\r\n\tIf you’re a customer of music on CDs or Vinyl, you can start downloading the MP3 version of a song for free with Amazon’s new autorip feature.","categories":["Amazon","amazon","Deals","Movies and Music","Music","Music Streaming","Music Streaming Services","General"],"author":"micha","pubDate":"2013-07-02T09:27:33.000Z"},{"guid":"htc-one-now-gorgeous-glamour-red-version","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/HTC One Red cropped.jpg","title":"HTC One now in a gorgeous \"glamour red\" version","description":"\n<h3>\r\n\tThought the mighty HTC One couldn't get any better? Think again.</h3>\r\n<!--break-->\r\n<p>The Taiwanese company has just revealed a new \"Glamour Red\" version of the smartphone that will be launching in the UK next month.<br />\r\n\t<br />\r\n\tBut there's a catch, you see. The new model will be available exclusively to British Phones 4u customers when it arrives there from mid-July.<br />\r\n\t<br />\r\n\tThere's no telling if this is to be a permanent arrangement, or whether HTC will open it up to other customers worldwide and in the Middle East as time goes on - We know we'd want it here in the UAE rather sooner than later.<br />\r\n\t<br />\r\n\t\"The new HTC One in Glamour Red showcases the power of our flagship model in a colour that demands attention, whilst maintaining the high standards set for sophisticated design and build quality,” said Philip Blair, President of EMEA, HTC.<br />\r\n\t<br />\r\n\tOf course inwardly it's still the same 4.7-inch, quad-core powered beauty that picked up five stars in our in-depth review.</p>\r\n<p></p>\r\n\n\n","summary":"\r\n\tThought the mighty HTC One couldn't get any better? Think again.","categories":["Android Phones","HTC","HTC One","Phones","SmartPhones","General"],"author":"Simon Khoury","pubDate":"2013-07-02T09:11:55.000Z"},{"guid":"foxconn-announces-its-own-iphone-compatible-smartwatch","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/foxcon-smartwatch.jpg","title":"Foxconn announces its own iPhone-compatible smartwatch","description":"\n<h3>\r\n\tFoxconn, the company best known for manufacturing Apple products, has apparently decided to go it alone after announcing its very own smartwatch.</h3>\r\n<!--break-->\r\n<p>There's no official Apple involvement in this one - but the (currently nameless) watch will be able to connect to your iPhone and perform a variety of features.</p>\r\n<p>Along with checking calls and status updates, Foxconn is reportedly including a variety of fitness functions such as a heart rate and respiration monitor. Fitting, as it does look a bit like the Nike+ Fuelband.</p>\r\n<p>According to reports, the company is planning to release incremental updates to the smartwatch which could include a fingerprint scanner.</p>\r\n<p>This is the second slice of smartwatch news we've had this week after <a href=\"http://www.t3me.com/news/lifestyle/accessories/your-watch-dumb-sony-releases-sw2-android-smartwatch\" target=\"_blank\">Sony revealed its Sony Smartwatch 2</a> with a 1.6-inch, 220 x 176 screen on Tuesday.</p>\r\n<p>And, as ever, the rumours of an Apple iWatch and a Google Android smartwatch continue to circulate.</p>\r\n<p>There's no word on any kind of release date for Foxconn's creation, but we here at T3me.com hope it becomes a reality sooner rather than later.</p>\r\n<p>What's your take on the growing smartwatch trend? Let us know your thoughts in the comments box below.</p>\r\n<p><strong>Source</strong>: <a href=\"http://www.wantchinatimes.com/news-subclass-cnt.aspx?id=20130627000079&amp;cid=1206\" target=\"_blank\">Wantchinatimes</a></p>\r\n\n\n","summary":"\r\n\tFoxconn, the company best known for manufacturing Apple products, has apparently decided to go it alone after announcing its very own smartwatch.","categories":["Apple accessories","Foxconn","iOS","Pebble Smartwatch","Phone Accessories","Phones","Smartwatch","smartwatch","General"],"author":"Simon Khoury","pubDate":"2013-07-01T12:38:15.000Z"},{"guid":"practical-meter-speedily-charges-your-devices-usb","type":"news","image":"http://t3me.com/sites/default/files/pictures/2013/quick/PracticalMeterCable-630x320.jpg","title":"Practical Meter speedily charges your devices via USB","description":"<h3>\r\n\tIf you've ever had to charge any device from your laptop's USB outlet, you know it could take longer than med school. Well not anymore...</h3>\r\n<!--break-->\r\n<p>USB charging is a complicated thing. While most smart devices (say smartphones) can handle up to 5W of charging juice, complex \"talk\" between the device and the USB circuitry means your device gets much less than that most of the times.</p>\r\n<p>This means extended charging times while you need that iPhone up and running asap.</p>\r\n<p>Practical Meter is a rather handy KickStarter project that does some cool things to remedy that conundrum.</p>\r\n<p>It sits between a USB power outlet (like your laptop's USB ports or solar charger) and the device you want to charge, displaying how efficient the charging process is via LED bars, and \"tricking\" the charging end into delivering the most power the device can safely handle.</p>\r\n<p>You can see from the screenshot below that charging an iPhone from a laptop's USB port normally takes 4 hours, but by using Practical Meter you can halve your waiting time into 1.5 hours.</p>\r\n<p></p>\r\n<p>Not only that, Practical Meter also includes a special cable with a USB tip from one end, and a microUSB, a miniUSB and an Apple 30-pin dock to charge all of your devices via one solution (and slash the amount of cables you lug around in your backpack).</p>\r\n<p><img align=\"bottom\" alt=\"T3 Middle East\" src=\"http://t3me.com/sites/default/files/pictures/2013/quick/bfd63b1162330fdb7629ae31a10b622a_large.jpg\" style=\"border-width: 0px; border-style: solid; margin: 5px; height: 229px; width: 450px;\" /></p>\r\n<p></p>\r\n<p><iframe frameborder=\"0\" height=\"480\" src=\"http://www.kickstarter.com/projects/david-toledo/the-practical-meter-know-your-power/widget/video.html\" width=\"640\"></iframe></p>\r\n<p></p>\r\n<p>You can pre-order <a href=\"http://www.kickstarter.com/projects/david-toledo/the-practical-meter-know-your-power\">Practical Meter via its KickStarter</a> project page.</p>\r\n<p></p>\n\n","summary":"\r\n\tIf you've ever had to charge any device from your laptop's USB outlet, you know it could take longer than med school. Well not anymore...","categories":["General"],"author":"Simon Khoury","pubDate":"2013-07-01T11:30:46.000Z"},{"guid":"how-repair-your-bricked-ps3-after-445-update-firmware-fix","type":"news","image":"http://www.t3me.com/sites/default/files/new-playstation-3.jpg","title":"How to repair your bricked PS3 after 4.45 update via firmware fix","description":"\n<h3>\r\n\tSony has released an update to repair the faulty firmware upgrade that left some PS3s ‘bricked’.</h3>\r\n<!--break--><br />\r\n<p>The company pulled PS3 update 4.45 when it became apparent it was causing some consoles to stop loading.<br />\r\n\t<br />\r\n\tLast week, the company released update 4.46. The update is designed to fix the problems that 4.45 was intended to fix, albeit without the problem that caused some PS3s to become inoperable.<br />\r\n\t<br />\r\n\tFor those PS3 owners affected by last week’s patch, Sony has published a step-by-step guide to install the new firmware.<br />\r\n\t<br />\r\n\tIt involves accessing the PS3’s hidden safe model. You will also require a USB stick.</p>\r\n<h4>\r\n\tStep 1: Manually Download System Software</h4>\r\n<ul>\r\n\t<li>\r\n\t\tYou will need a USB Mass Storage device such as a USB flash drive with at least 168 MB of free space. If your PS3 is either CECHA00/CECHB00 series model, you can also use Memory Stick™, SD Memory Card, and CompactFlash®.</li>\r\n\t<li>\r\n\t\tCreate a folder named \"PS3\" on the storage media or USB device.</li>\r\n\t<li>\r\n\t\tWithin the PS3 folder, create a folder named \"UPDATE\".</li>\r\n\t<li>\r\n\t\tUsing your computer, click the following hyperlink to <a href=\"http://dus01.ps3.update.playstation.net/update/ps3/image/us/2013_0627_6085b02c415ec912fab4670d7957db68/PS3UPDAT.PUP\">begin downloading system software 4.46</a></li>\r\n\t<li>\r\n\t\tDownload the update data from the webpage and save it in the \"UPDATE\" folder.</li>\r\n\t<li>\r\n\t\tLocation: Save in the \"PS3\" folder &gt; \"UPDATE\" folder</li>\r\n\t<li>\r\n\t\tFile name: Save as file name \"PS3UPDAT.PUP\"</li>\r\n\t<li>\r\n\t\tNote: If the data is not saved in the correct way, the PS3 will not recognize the update data. The folder name must be in all uppercase letters.</li>\r\n</ul>\r\n<h4>\r\n\tStep 2: Activate Safe Mode</h4>\r\n<ul>\r\n\t<li>\r\n\t\tWith the PS3 off (power light should be red), touch and hold the Power button, you will hear the 1st beep indicating that the PS3 is powering on.</li>\r\n\t<li>\r\n\t\tContinue to hold the power button, and after approximately 5 seconds you will hear a 2nd beep.</li>\r\n\t<li>\r\n\t\tContinue to hold the power button and after 5 more seconds you'll hear a 3rd beep, and system will power off (Power light goes red).</li>\r\n\t<li>\r\n\t\tRelease power button.</li>\r\n\t<li>\r\n\t\tTouch and hold the Power button, you will hear the 1st beep, again for PS3 power on.</li>\r\n\t<li>\r\n\t\tContinue to hold and after approximately 5 seconds you will hear the 2nd beep for video reset.</li>\r\n\t<li>\r\n\t\tContinue to hold and after 5 seconds you will hear a quick double beep. At that point release power button.</li>\r\n\t<li>\r\n\t\tIf you succeeded in activating Safe Mode, you will see a message on screen saying, \"Connect the controller using a USB cable and then press the PS button\".</li>\r\n\t<li>\r\n\t\tConnect a controller to the PS3 with a USB cable.</li>\r\n\t<li>\r\n\t\tIf you were not able to get into Safe Mode, your system may need service. Please contact us for further assistance.</li>\r\n</ul>\r\n<h4>\r\n\tStep 3: Manually Update PS3 Software</h4>\r\n<ul>\r\n\t<li>\r\n\t\tConnect the storage media to PS3 system.</li>\r\n\t<li>\r\n\t\tSelect [6 - System Update] and Press X.</li>\r\n\t<li>\r\n\t\tPlease note: Data and settings may be deleted if you choose any of the first (5) options. Please make sure to only choose option [6 - System Update].</li>\r\n\t<li>\r\n\t\tPress Start and Select at the same time.</li>\r\n\t<li>\r\n\t\tThe PS3 system will restart and recognizes the update file in the storage media.</li>\r\n\t<li>\r\n\t\tPress right on the d-pad to scroll through the update description and user agreement.</li>\r\n\t<li>\r\n\t\tPress X to confirm the update.</li>\r\n\t<li>\r\n\t\tThe system will now install the new system software and restart automatically upon completion.</li>\r\n</ul>\r\n<p></p>\r\n\n\n","summary":"\r\n\tSony has released an update to repair the faulty firmware upgrade that left some PS3s ‘bricked’.","categories":["PS3 SuperSlim","Consoles","device problems","Firmware","Gaming","Playstation","PlayStation 3","PS3","Sony","General"],"author":"Simon Khoury","pubDate":"2013-07-01T10:16:02.000Z"},{"guid":"far-cry-3-spinoff-blood-dragon-sells-half-million-copies","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/07/Far-Cry-3-Blood-Dragon-3.jpg","title":"Far Cry 3 spinoff Blood Dragon sells half a million copies","description":"\n<h3>\r\n\tBlood Dragon, the spin off to Ubisoft’s Far Cry 3 has sold over 500,000 digital copies across PC, PSN and Xbox Live Arcade.</h3>\r\n<!--break--><br />\r\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/0dofacvjRkc?feature=player_detailpage\" width=\"640\"></iframe></p>\r\n<p>The publisher’s chief executive revealed the figure in an interview with Games Industry. However, Yves Guillemot did not say how the figures were split across the platforms.<br />\r\n\t<br />\r\n\tHe did however expresss his happiness at the add-on’s performance on PC. According to Guillemot, sales of Blood Dragon on the PC were boosted by its positive reception.<br />\r\n\t<br />\r\n\tAccording to reports earlier this month, the developers have already pitched a sequel as a standalone game.<br />\r\n\t<br />\r\n\tGuillemot confirmed that Ubisoft has recognised the game’s critical and commerical success. He said that the publisher was looking into the possibility of releasing a sequel as a standalone title.</p>\r\n<p></p>\r\n\n\n","summary":"\r\n\tBlood Dragon, the spin off to Ubisoft’s Far Cry 3 has sold over 500,000 digital copies across PC, PSN and Xbox Live Arcade.","categories":["2013 games","DLC","FPS","Game Charts","Games","Gaming","Ubisoft","General"],"author":"T3 Middle East","pubDate":"2013-07-01T10:00:45.000Z"},{"guid":"xbox-one-e3-game-videos-watch-them-all-here","type":"features","image":"http://www.t3me.com/sites/default/files/feature/2013/06/Xbone conference stage-580-75.jpg","title":"Xbox One E3 game videos: Watch them all here","description":"\n<h3>\r\n\tAfter Sony had finally revealed the PlayStation 4, Microsoft's E3 show was a gaming bonanza. We gathered all of the Xbox One's game videos in one yummy scoop for your viewing pleasure. Curb your enthusiasm!</h3>\r\n<!--break-->\r\n<h4>\r\n\t&nbsp;</h4>\r\n<h4>\r\n\tBattlefield 4</h4>\r\n<h4>\r\n\t<iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/wBSbxjkLXuU?feature=player_embedded\" width=\"640\"></iframe></h4>\r\n<h4>\r\n\t&nbsp;</h4>\r\n<h4>\r\n\tBelow</h4>\r\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/8wuR9lOnGNo?feature=player_embedded\" width=\"640\"></iframe></p>\r\n<h4>\r\n\t&nbsp;</h4>\r\n<h4>\r\n\tD4</h4>\r\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/tNfkMTY66fI?feature=player_embedded\" width=\"640\"></iframe></p>\r\n<h4>\r\n\t&nbsp;</h4>\r\n<h4>\r\n\tDark Souls 2</h4>\r\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/DN_7WZBL0J8?feature=player_embedded\" width=\"640\"></iframe></p>\r\n<h4>\r\n\t&nbsp;</h4>\r\n<h4>\r\n\tDead Rising 3</h4>\r\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/9TFp7vawsoI?feature=player_embedded\" width=\"640\"></iframe></p>\r\n<h4>\r\n\t&nbsp;</h4>\r\n<h4>\r\n\tForza Motorsport 5</h4>\r\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/XRddhsV-rnk?feature=player_embedded\" width=\"640\"></iframe></p>\r\n<h4>\r\n\t&nbsp;</h4>\r\n<h4>\r\n\tHalo 5</h4>\r\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/1qSTpClAybI?feature=player_embedded\" width=\"640\"></iframe></p>\r\n<h4>\r\n\t&nbsp;</h4>\r\n<h4>\r\n\tKiller Instinct</h4>\r\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/ErPxgMKZAG4?feature=player_embedded\" width=\"640\"></iframe></p>\r\n<h4>\r\n\t&nbsp;</h4>\r\n<h4>\r\n\tKinect Sports Rivals</h4>\r\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/7WDX1Jqnfww?feature=player_embedded\" width=\"640\"></iframe></p>\r\n<h4>\r\n\t&nbsp;</h4>\r\n<h4>\r\n\tMax: The Curse Of Brotherhood</h4>\r\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/sDA4ISggZPI?feature=player_embedded\" width=\"640\"></iframe></p>\r\n<h4>\r\n\t&nbsp;</h4>\r\n<h4>\r\n\tMetal Gear Solid V: The Phantom Pain</h4>\r\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/4KevMPxaUtM?feature=player_embedded\" width=\"640\"></iframe></p>\r\n<h4>\r\n\t&nbsp;</h4>\r\n<h4>\r\n\tProject Spark</h4>\r\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/dhPuesOsvf8?feature=player_embedded\" width=\"640\"></iframe></p>\r\n<h4>\r\n\t&nbsp;</h4>\r\n<h4>\r\n\tQuantum Break</h4>\r\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/LBGt7YsR7CU?feature=player_embedded\" width=\"640\"></iframe></p>\r\n<h4>\r\n\t&nbsp;</h4>\r\n<h4>\r\n\tRyse: Son Of Rome</h4>\r\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/qrc96mPw4iA?feature=player_embedded\" width=\"640\"></iframe></p>\r\n<h4>\r\n\t&nbsp;</h4>\r\n<h4>\r\n\tSunset Overdrive</h4>\r\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/VSyXA7AJ_L8?feature=player_embedded\" width=\"640\"></iframe></p>\r\n<h4>\r\n\t&nbsp;</h4>\r\n<h4>\r\n\tTitanFall</h4>\r\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/tv6lzSuTHhs?feature=player_embedded\" width=\"640\"></iframe></p>\r\n<h4>\r\n\t&nbsp;</h4>\r\n<h4>\r\n\tWorld Of Tanks</h4>\r\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/v9FoawWAIbA?feature=player_embedded\" width=\"640\"></iframe></p>\r\n<h4>\r\n\t&nbsp;</h4>\r\n<p>&nbsp;</p>\r\n\n\n","summary":"\r\n\tAfter Sony had finally revealed the PlayStation 4, Microsoft's E3 show was a gaming bonanza. We gathered all of the Xbox One's game videos in one yummy scoop for your viewing pleasure. Curb your enthusiasm!","categories":["E3 2013","Editorials","game demo","Games","Gaming","trailers","Xbox","xbox one","Xbox One"],"author":"T3 Middle East","pubDate":"2013-06-29T10:49:15.000Z"},{"guid":"google-sell-htc-one-nexus-edition","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/06/HTC-One-Nexus-624.jpg","title":"Google to sell HTC One Nexus Edition","description":"\n<h3>\r\n\tThe <a href=\"http://t3me.com/category/free-tags/htc-one\" target=\"_blank\">HTC One</a> Nexus Edition has now been confirmed after HTC announced that Google will be offering a special edition HTC One sporting just Android 4.2.2.</h3>\r\n<!--break-->\r\n<p>Initially the company denied the existence of such a handset but Google's own Sundar Pichai confirmed that a 32GB HTC One Nexus Edition would be launching at the end of June sporting the Nexus UI.</p>\r\n<p>At present the HTC One currently features HTC's own Sense 5 UI which offers up a more minimalist interface along with the Blinkfeed aggregated newsfeed.</p>\r\n<p>It also seems certain that the HTC One Nexus Edition would also lose HTC Zoe which uses the One's Ultrapixel camera to take short three second videos which can then be shared.</p>\r\n<p>Of course being a Nexus phone that also means you'll get an unlocked Bootloader for those who want a truly customisable experience.</p>\r\n<p>One aspect that will remain is HTC's Beats Audio integration, as this is more a hardware feature the Beats Audio technology will run in the background but won't appear at any point in the OS.</p>\r\n<p>More importantly, HTC are also reportedly working on a solution to allow HTC One users with Sense 5 the option to actually switch their smartphones over the stock Android 4.2.2.</p>\r\n<p>The HTC One Nexus Edition will be available in the US Google Play Store from June 26th with a worldwide release date not yet decided. The One will be joining both the <a href=\"http://www.t3me.com/category/story-stream/lg-nexus-4\" target=\"_blank\">Google Nexus 4</a> and the <a href=\"http://www.t3me.com/news/phones/smartphones/android-phones/googles-nexus-based-galaxy-s4-gets-faster-updates-has-more-us\" target=\"_blank\">Samsung Galaxy S4 Nexus Edition</a> in Google's increasing line-up of flagship stock Android smartphones.</p>\r\n\n\n","summary":"\r\n\tThe <a href=\"http://t3me.com/category/free-tags/htc-one\" target=\"_blank\">HTC One</a> Nexus Edition has now been confirmed after HTC announced that Google will be offering a special edition HTC One sporting just Android 4.2.2.","categories":["Android","Android phones","Android Phones","Google","Google Nexus","HTC","HTC One","Phones","SmartPhones","General"],"author":"Thomas Tamblyn","pubDate":"2013-06-29T10:49:14.000Z"},{"guid":"samsung-forum-keynote-refreshes-tv-home-theater-and-digital-imaging-sector","type":"news","image":"http://www.t3me.com/sites/default/files/DSC00679.JPG","title":"Samsung Forum Keynote refreshes the TV, Home Theater, and Digital Imaging sector for the Middle East","description":"\n<h3>\r\n\tThe Samsung 4K and F8000 televisions, NX300 camera, ATIV tablets, 2013 Smart Hub, and Smart Control remote control make their debut into the Middle Eastern Market.</h3>\r\n<p><!--break--></p>\r\n<p>It's the beginning of a new year, and with that comes the yearly Samsung Forum exhibition, where we take a look at the brands new technologies for the coming year.&nbsp;</p>\r\n<p>If you have been keeping tabs on your CES coverage earlier last month, you'll be familiar with several of the products debuting at the Forum on a regional scale.&nbsp;Samsung wants to further push boundaries between people and devices, having done so exponentially in 2012 with a revenue of $200,000, seeing a 65% growth in the region.</p>\r\n<p>This year, Samsung's goal is to innovate and allow users to discover with Smart TVs, refrigerators and washing machines, with additional focus on improving the world's learning environment.</p>\r\n<p>Expect the next step in Smart TVs, further innovation in home appliances, a focus on the 'social' aspect of digital camera category and improved navigation.</p>\r\n<p>Samsung has recognized four television trends between users:&nbsp;larger screen sizes, televisions becoming an integral part of the living room, users expecting more from their TVs, and second screen viewing (pairing the TV with smartphones and tablets).</p>\r\n<p><strong>Televisions</strong></p>\r\n<p>Leading the charge is Samsung's flagship F8000 LED TV, the first in its line-up to feature a quad-core processor. Features include an ultra-thin profile, quarter-inch thick bezel and a wave-inspired Arc stand making the television appear as though it's floating in the air.&nbsp;</p>\r\n<p>Also a first in its line-up is the 85-inch Ultra High Definition TV, or UHD TV, the 85S9. It features a complete boarder called the Timeless Gallery design, also making it appear as though it is floating. The 85S9 is Ultra HD, Samsung's way of saying 4K - four times the resolution of Full HD displays. Embedded is also a display converter than can take HD and Full HD content and automatically upscale it to UHD resolution.&nbsp;</p>\r\n<p>Also big news for 2013, and seen at CES, is the Evolution Kit, capable of breathing in fresh life to your older Smart TV models. Add the Evolution Kit and immediately access the latest Smart TV offerings including quad-core power and the new Smart Hub.</p>\r\n<p><strong>Smart Hub</strong></p>\r\n<p>A new Smart Hub has also been introduced within 2013 Smart TV models. The new update brings a complete redesign, intelligently organizing a user's content into clear menu panels for simple and intuitive viewing. The three new panels include Apps, Photos, Videos &amp; Music, and Social.</p>\r\n<p><strong>Home Theater&nbsp;</strong></p>\r\n<p>The HT-F9750W is Samsung's latest in home theater technology - a 1,330-watt sound system from four speaker towers, and a central speaker. New for the year is the addition of Samsung's Gallium Nitride amplifier, paired with last year's vacuum tube to create pure and natural sound.&nbsp;</p>\r\n<p>The HW-F751 is Samsung's second home theater product, the AirTrack, a sound bar that can connect with a TV via Bluetooth and doubles as a wireless speaker for your smartphone or tablet. This too sees the integration of the vacuum tube, delivering warmer, more immersive sounds with almost no distortion.&nbsp;</p>\r\n<p><strong>Digital Imaging</strong></p>\r\n\r\n\n","summary":"\r\n\tThe Samsung 4K and F8000 televisions, NX300 camera, ATIV tablets, 2013 Smart Hub, and Smart Control remote control make their debut into the Middle Eastern Market.","categories":["4K / Ultra-HD","Audio - Music","Dubai","Events","home theater","Home Theatre","Media Centers","Middle East","Samsung","samsung forum","Samsung Forum","Samsung Smart TV","Samsung TVs","Smart TV","TV-Video","UAE"],"author":"Ramzi Ayash","pubDate":"2013-06-29T10:49:13.000Z"},{"guid":"samsung-forum-2013-its-all-about-television","type":"news","image":"http://www.t3me.com/sites/default/files/photo.JPG","title":"Samsung Forum 2013: It's all about the television","description":"\n<h3>\r\n\tEvery year, Samsung follows their worldwide debuts at CES with a more region-specific exhibition for the Middle East. This is Samsung Forum 2013</h3>\r\n<!--break-->\r\n<p>You've seen Samsung's monstrous coverage at CES 2013 earlier in January. It's selection of tech was packed with various curved screens, mobile phones, digital cameras, and more. Taking center stage, however, were televisions - and not only with Samsung. Sony and LG were also kicking it up a notch with OLED, 4K and the occassional curved glass display.</p>\r\n<p><span style=\"font-size: 11px;\"><span style=\"font-family: Tahoma, sans-serif; line-height: 20px;\">Today, Samsung will be delivering setting the scene for the new year with a strategy for each one of their technology sections and a closer look at the models that will later debut in the region.&nbsp;</span></span></p>\r\n<p>Samsung Forum 2013 is also a time for sales representatives to familiarize themselves with the future products. So we will be taking you through every single unveiling and bringing you tech specs and price points, too. Samsung Forum 2013 begins at 10am Dubai time and 8am Beirut time. &nbsp;</p>\r\n\r\n\n","summary":"\r\n\tEvery year, Samsung follows their worldwide debuts at CES with a more region-specific exhibition for the Middle East. This is Samsung Forum 2013","categories":["Events","Events / Expos","Samsung Forum 2013"],"author":"Ramzi Ayash","pubDate":"2013-06-29T10:25:00.000Z"},{"guid":"your-watch-dumb-sony-releases-sw2-android-smartwatch","type":"news","image":"http://www.t3me.com/sites/default/files/news/2013/06/sony-smartwatch-sw2.jpg","title":"Your watch is dumb: Sony releases the SW2 Android smartwatch","description":"\n<h3>\r\n\tSony introduces its Android water-resistant, NFC-equipped SmartWatch, the SW2.</h3>\r\n<!--break-->\r\n<p>Following Casio’s line of “computer watches” several decades ago, Sony has brought about a new craze: the Sony SmartWatch 2. Enabled with NFC connectivity, the watch is filled with a variety of features and easily serves as a partner to the Android smartphone.</p>\r\n<p>Good news for the clumsy who regularly drop objects into water, the innovative watch is also waterproof and water resistant. That means you can go swimming or shower without worrying about having to get a new watch. This is guaranteed by the IP57 rating the SmartWatch 2 has received, which allows for an immersion of liquid ranging between a depth of 15cm to 1m.</p>\r\n<p>Among the different features the watch offers is the ability to take calls or use it to remotely trigger your camera shutter. If you decide to take a jog, you can turn to the watch to quickly glance at its mapping facet.</p>\r\n<p>Moreover, NFC eases the process of pairing and even contains Facebook login. Android leaves its mark on the user interface, which gives a similar feel.</p>\r\n<p>In contrast with the previous generation of this model, the SmartWatch 2 has a larger 1.6-inch display that offers a better view of daylight with its 220 x 176 pixel resolution.</p>\r\n<p align=\"left\">It is designed with an aluminum feature that holds a button reminiscent to that of <a href=\"http://www.t3me.com/reviews/phones/smartphones/android-phones/xperia-z-ultra-revealed-worlds-slimmest-and-fastest-and-la\">Sony’s Xperia Z, or the new Z Ultra</a> and their kin of phones and tablets. The new watch will be available in an array of colors and strap styles to choose from.</p>\r\n\n\n","summary":"\r\n\tSony introduces its Android water-resistant, NFC-equipped SmartWatch, the SW2.","categories":["Android","Pebble Smartwatch","smartwatch","Smartwatch","Sony","sony 2013","SW2","Product Releases"],"author":"T3 Middle East","pubDate":"2013-06-28T08:12:05.000Z"}]}]